Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
/**************************************************************************//**
 * @file     rtl8735b_sgpio.c
 * @brief    This file implements the SGPIO HAL functions in ROM.
 *
 * @version  V1.00
 * @date     2020-08-13
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "hal_irq.h"
#include "hal_gdma.h"
#include "rtl8735b_sgpio_type.h"
#include "hal_cache.h"
#include "hal_sys_ctrl.h"
#include "hal_sys_ctrl_nsc.h"

#if CONFIG_SGPIO_EN

#define SECTION_SGPIO_TEXT           //SECTION(".ram.hal_sgpio.text")
#define SECTION_SGPIO_DATA           //SECTION(".ram.hal_sgpio.data")
#define SECTION_SGPIO_RODATA         //SECTION(".ram.hal_sgpio.rodata")
#define SECTION_SGPIO_BSS            //SECTION(".ram.hal_sgpio.bss")
#define SECTION_SGPIO_STUBS          //SECTION(".ram.hal_sgpio.stubs")

#if !defined(CONFIG_BUILD_NONSECURE)

#undef SGPIO_REG_BASE
#define SGPIO_REG_BASE (SGPIO_S_BASE)

#else

#undef SGPIO_REG_BASE
#define SGPIO_REG_BASE (SGPIO_BASE)

#endif


/**
 * @addtogroup hs_hal_sgpio PCM
 * @{
 */

/**
  * @brief The global common data structure to store common resource
  *        for all SGPIO adapters.
  */
SECTION_SGPIO_BSS hal_sgpio_group_adapter_t sgpio_group_adapter;

/**
  * @brief SGPIO Pin mux table for SGPIO_TX and SGPIO_RX pin
  */
SECTION_SGPIO_RODATA const uint8_t sgpio_pin[] = {
// TBD: the pin names need to be corrected
	PIN_F15, PIN_F14, 0xFF,   /* SGPIO0 S0 */
	PIN_F15, PIN_F14, 0xFF,   /* SGPIO0 S1 */
	PIN_F15, PIN_F14, 0xFF, /* SGPIO0 S2 */
	0xFF, 0xFF, 0xFF,

	PIN_F15, PIN_F14, 0xFF,   /* SGPIO1 S0 */
	PIN_F15, PIN_F14, 0xFF,   /* SGPIO1 S1 */
	PIN_F15, PIN_F14, 0xFF, /* SGPIO1 S2 */
	0xFF, 0xFF, 0xFF,

	PIN_F15, PIN_F14, 0xFF,   /* SGPIO2 S0 */
	PIN_F15, PIN_F14, 0xFF,   /* SGPIO2 S1 */
	PIN_F15, PIN_F14, 0xFF,  /* SGPIO2 S2 */
	0xFF, 0xFF, 0xFF
};

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_sgpio_rom_func SGPIO HAL ROM APIs.
 * @ingroup hs_hal_sgpio
 * @{
 * @brief The SGPIO HAL ROM APIs. The user application(in RAM space) should not call these APIs directly.
 *        There is another set of SGPIO HAL APIs in the RAM space is provided for the user application.
 */

/**
  * @brief The stubs functions table to exports SGPIO HAL functions in ROM.
  */
SECTION_SGPIO_STUBS const hal_sgpio_func_stubs_t hal_sgpio_stubs = {
	.psgpio_group_adapter = &sgpio_group_adapter,
	.psgpio_pin = sgpio_pin,
	.hal_sgpio_irq_handler = hal_rom_sgpio_irq_handler,
	.hal_sgpio_irq_reg = hal_rom_sgpio_irq_reg,
	.hal_sgpio_unreg = hal_rom_sgpio_unreg,
	.hal_sgpio_reg_cb = hal_rom_sgpio_reg_cb,
	.hal_sgpio_unreg_cb = hal_rom_sgpio_unreg_cb,
	.hal_sgpio_en_ctrl = hal_rom_sgpio_en_ctrl,
	.hal_sgpio_init = hal_rom_sgpio_init,
	.hal_sgpio_deinit = hal_rom_sgpio_deinit,
	.hal_sgpio_enter_critical = hal_rom_sgpio_enter_critical,
	.hal_sgpio_exit_critical = hal_rom_sgpio_exit_critical,
	.hal_sgpio_set_rxtc_stop_ctrl = hal_rom_sgpio_set_rxtc_stop_ctrl,
	.hal_sgpio_get_rxtc_stop_ctrl = hal_rom_sgpio_get_rxtc_stop_ctrl,
	.hal_sgpio_set_rxtc_reset_ctrl = hal_rom_sgpio_set_rxtc_reset_ctrl,
	.hal_sgpio_get_rxtc_reset_ctrl = hal_rom_sgpio_get_rxtc_reset_ctrl,
	.hal_sgpio_set_rxtc_match_value = hal_rom_sgpio_set_rxtc_match_value,
	.hal_sgpio_set_rxtc_int = hal_rom_sgpio_set_rxtc_int,
	.hal_sgpio_set_capture_ctrl = hal_rom_sgpio_set_capture_ctrl,
	.hal_sgpio_set_capture_compare = hal_rom_sgpio_set_capture_compare,
	.hal_sgpio_set_capture_int = hal_rom_sgpio_set_capture_int,
	.hal_sgpio_set_multc_stop_ctrl = hal_rom_sgpio_set_multc_stop_ctrl,
	.hal_sgpio_get_multc_stop_ctrl = hal_rom_sgpio_get_multc_stop_ctrl,
	.hal_sgpio_set_multc_reset_ctrl = hal_rom_sgpio_set_multc_reset_ctrl,
	.hal_sgpio_get_multc_reset_ctrl = hal_rom_sgpio_get_multc_reset_ctrl,
	.hal_sgpio_set_multc_match_value = hal_rom_sgpio_set_multc_match_value,
	.hal_sgpio_set_multc_match_event0_int = hal_rom_sgpio_set_multc_match_event0_int,
	.hal_sgpio_set_multc_match_group = hal_rom_sgpio_set_multc_match_group,
	.hal_sgpio_set_multc_fifo_value = hal_rom_sgpio_set_multc_fifo_value,
	.hal_sgpio_set_rxtc_external_match = hal_rom_sgpio_set_rxtc_external_match,
	.hal_sgpio_set_multc_external_match = hal_rom_sgpio_set_multc_external_match,
	.hal_sgpio_set_multc_match_event0_cnt_int = hal_rom_sgpio_set_multc_match_event0_cnt_int,
	.hal_sgpio_set_multc_match_event0_cnt = hal_rom_sgpio_set_multc_match_event0_cnt,
	.hal_sgpio_init_rxdata_time_sampling = hal_rom_sgpio_init_rxdata_time_sampling,
	.hal_sgpio_deinit_rxdata_time_sampling = hal_rom_sgpio_deinit_rxdata_time_sampling,
	.hal_sgpio_init_rxdata_capture_compare = hal_rom_sgpio_init_rxdata_capture_compare,
	.hal_sgpio_deinit_rxdata_capture_compare = hal_rom_sgpio_deinit_rxdata_capture_compare,
	.hal_sgpio_set_rxdata_load_int = hal_rom_sgpio_set_rxdata_load_int,
	.hal_sgpio_set_rxdata_prebuf_bit_shift_int = hal_rom_sgpio_set_rxdata_prebuf_bit_shift_int,
	.hal_sgpio_reset_rxdata = hal_rom_sgpio_reset_rxdata,
	.hal_sgpio_set_rxdata_match_int = hal_rom_sgpio_set_rxdata_match_int,
	.hal_sgpio_set_txdata_bit_length_int = hal_rom_sgpio_set_txdata_bit_length_int,
	.hal_sgpio_set_txdata_prebuf_bit_shift_int = hal_rom_sgpio_set_txdata_prebuf_bit_shift_int,
	.hal_sgpio_reset_txdata = hal_rom_sgpio_reset_txdata,
	.hal_sgpio_set_time_to_rxtc = hal_rom_sgpio_set_time_to_rxtc,
	.hal_sgpio_set_time_to_multc = hal_rom_sgpio_set_time_to_multc,
	.hal_sgpio_set_rxtc_to_time = hal_rom_sgpio_set_rxtc_to_time,
	.hal_sgpio_set_multc_to_time = hal_rom_sgpio_set_multc_to_time,
	.hal_sgpio_clean_status = hal_rom_sgpio_clean_status,
	.hal_sgpio_update_rxtcmr = hal_rom_sgpio_update_rxtcmr,
	.hal_sgpio_update_multcmr = hal_rom_sgpio_update_multcmr,
	.hal_sgpio_rxtc_timer_mode = hal_rom_sgpio_rxtc_timer_mode,
	.hal_sgpio_multc_timer_mode = hal_rom_sgpio_multc_timer_mode,
	.hal_sgpio_multc_counter_mode = hal_rom_sgpio_multc_counter_mode,
	.hal_sgpio_rxtc_timer_match_output = hal_rom_sgpio_rxtc_timer_match_output,
	.hal_sgpio_multc_timer_counter_match_output = hal_rom_sgpio_multc_timer_counter_match_output,
	.hal_sgpio_rxtc_capture_mode = hal_rom_sgpio_rxtc_capture_mode,
	.hal_sgpio_rxtc_capture_timeout = hal_rom_sgpio_rxtc_capture_timeout,
	.hal_sgpio_rxtc_capture_monitor = hal_rom_sgpio_rxtc_capture_monitor,
	.hal_sgpio_get_rxtc_capture_time = hal_rom_sgpio_get_rxtc_capture_time,
	.hal_sgpio_init_rxdata_capture_compare_time = hal_rom_sgpio_init_rxdata_capture_compare_time,
	.hal_sgpio_sampling_rxdata = hal_rom_sgpio_sampling_rxdata,
	.hal_sgpio_get_input_rxdata = hal_rom_sgpio_get_input_rxdata,
	.hal_sgpio_get_arrange_rxdata =  hal_rom_sgpio_get_arrange_rxdata,
	.hal_sgpio_capture_compare_rxdata = hal_rom_sgpio_capture_compare_rxdata,
	.hal_sgpio_txdata_bit_symbol =  hal_rom_sgpio_txdata_bit_symbol,
	.hal_sgpio_txdata =  hal_rom_sgpio_txdata,
	.hal_sgpio_txdata_bit_length_irq =  hal_rom_sgpio_txdata_bit_length_irq,
	.hal_sgpio_send_txdata = hal_rom_sgpio_send_txdata,
	.hal_sgpio_reset_receive_rxdata = hal_rom_sgpio_reset_receive_rxdata,
	.hal_sgpio_disable_rxdata_match = hal_rom_sgpio_disable_rxdata_match,
	.hal_sgpio_monitor_rxdata = hal_rom_sgpio_monitor_rxdata,
	.hal_sgpio_multc_fifo_reset = hal_rom_sgpio_multc_fifo_reset,
	.hal_sgpio_dma_match_output_irq_handle = hal_rom_sgpio_dma_match_output_irq_handle,
	.hal_sgpio_dma_match_output_init = hal_rom_sgpio_dma_match_output_init,
	.hal_sgpio_dma_match_output_deinit = hal_rom_sgpio_dma_match_output_deinit,
	.hal_sgpio_dma_handshake_init = hal_rom_sgpio_dma_handshake_init,
	.hal_sgpio_dma_preload_data = hal_rom_sgpio_dma_preload_data,
	.hal_sgpio_dma_send_start = hal_rom_sgpio_dma_send_start,
	.hal_sgpio_dma_time_to_multc = hal_rom_sgpio_dma_time_to_multc
};

/**
 *  @brief This is the common interrupt handler for all SGPIOs.
 *         It read the system register to know the interrupt event
 *         is triggered by which SGPIO device.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void SGPIO_IRQHandler_ram(void)
{
	uint8_t i;

