Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	hal_irq_clear_pending(SGPIO_IRQn);

	for (i = 0; i < Sgpio_Max_Id; i++) {
		if ((sgpio_group_adapter.psgpio_adapter[i] != (hal_sgpio_adapter_t *)NULL) &&
			(sgpio_group_adapter.irq_fun[i] != (irq_handler_t)NULL)) {
			sgpio_group_adapter.irq_fun[i]((void *)(sgpio_group_adapter.psgpio_adapter[i]));
		}
	}
}

/**
 *  @brief The SGPIO interrupt handler. It process all interrupt events.
 *
 *  @param[in]  hid The handler ID, it should be the sgpio adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_irq_handler(void *hid)
{
	hal_sgpio_adapter_t *psgpio_adp;
	SGPIO_TypeDef *psgpio_reg;
	u8 irq_bit_shift;
	u32 bit_shift_temp;
	u32 sgpio_is_reg;

	psgpio_adp = (hal_sgpio_adapter_t *)hid;
	psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	sgpio_is_reg =  psgpio_reg->SGPIO_IS;
	psgpio_reg->SGPIO_IS = sgpio_is_reg;
	sgpio_is_reg = sgpio_is_reg & ~(psgpio_reg->SGPIO_IM);

	for (irq_bit_shift = 0 ; irq_bit_shift < Max_Sgpio_Sft; irq_bit_shift++) {
		if (psgpio_adp->irq_user_cb[irq_bit_shift] != NULL) {
			bit_shift_temp = (1 << irq_bit_shift);
			if ((sgpio_is_reg & bit_shift_temp) == bit_shift_temp) {
				psgpio_adp->irq_user_cb[irq_bit_shift](psgpio_adp->user_arg[irq_bit_shift]);
			}
		}
	}

}

/**
 *  @brief To register a IRQ handler for the SGPIO.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_irq_reg(void)
{
	uint8_t i;

	for (i = 0; i < Sgpio_Max_Id; i++) {
		if (sgpio_group_adapter.irq_fun[i] != NULL) {
			break;
		}
	}

	if (i == Sgpio_Max_Id) {
		hal_irq_disable(SGPIO_IRQn);
		__ISB();

		// Register SGPIO common IRQ handler
		hal_irq_set_vector(SGPIO_IRQn, (uint32_t)SGPIO_IRQHandler_ram);
		hal_irq_clear_pending(SGPIO_IRQn);
		hal_irq_enable(SGPIO_IRQn);
	}
}

/**
 *  @brief To un-register the SGPIO IRQ handler.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_unreg(hal_sgpio_adapter_t *psgpio_adp)
{
	uint8_t i;

	sgpio_group_adapter.irq_fun[psgpio_adp->sgpio_index] = (irq_handler_t)NULL;
	for (i = 0; i < Sgpio_Max_Id; i++) {
		if (sgpio_group_adapter.irq_fun[i] != NULL) {
			break;
		}
	}

	if (i == Sgpio_Max_Id) {
		// No any SGPIO port has IRQ handler, so disable the common interrupt
		hal_irq_disable(SGPIO_IRQn);
		__ISB();
	}


}

/**
 *  @brief Register the callback function and argument of the interrupt event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  callback The callback function.
 *  @param[in]  arg The callback argument.
 *  @param[in]  irq_shift The interrupt event number.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_reg_cb(hal_sgpio_adapter_t *psgpio_adp, sgpio_irq_user_cb_t callback, void *arg, sgpio_irq_shift_t irq_shift)
{
	if (callback != NULL) {
		psgpio_adp->irq_user_cb[irq_shift] = callback;
		psgpio_adp->user_arg[irq_shift] = arg;
	} else {
		psgpio_adp->irq_user_cb[irq_shift] = NULL;
		psgpio_adp->user_arg[irq_shift] = NULL;
	}
}

/**
 *  @brief Cancel the callback function and argument of the interrupt event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  irq_shift The interrupt event number.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_unreg_cb(hal_sgpio_adapter_t *psgpio_adp, sgpio_irq_shift_t irq_shift)
{
	psgpio_adp->irq_user_cb[irq_shift] = NULL;
	psgpio_adp->user_arg[irq_shift] = NULL;
}

/**
 *  @brief To enable or disable SGPIO for the platform.
 *
 *  @param[in] sgpio_index The SGPIO index. It can be 0 .. 2.
 *  @param[in] en  Enable control: 0: disable, 1: enable.
 *
 *  @return     HAL_ERR_PARA
 *  @return     HAL_OK
 */
SECTION_SGPIO_TEXT
HAL_Status hal_rom_sgpio_en_ctrl(sgpio_index_sel_t sgpio_index, BOOL en)
{
	hal_sys_peripheral_en(SGPIO_SYS, en);
	//*((uint32_t*)(0x40000800 + 0x138)) = 0xF0;
	//*((uint32_t*)(0x50000800 + 0x138)) = 0xF0;

	return HAL_OK;
}

/**
 *  @brief Initialize the sgpio hardware and turn on the SGPIO
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  sgpio_index The SGPIO index. It can be 0 .. 2.
 *  @param[in]  pin_sel sgpio pin mux.
 *
 *  @return     HAL_ERR_PARA
 *  @return     HAL_OK
 */
SECTION_SGPIO_TEXT
HAL_Status hal_rom_sgpio_init(hal_sgpio_adapter_t *psgpio_adp, sgpio_index_sel_t sgpio_index)
{
	uint8_t i;
	SGPIO_TypeDef *psgpio_reg;
	HAL_Status ret = HAL_OK;

	if (psgpio_adp == NULL) {
		//dbg_printf("hal_sgpio_init_rtl8195bhp: psgpio_adp is null \r\n");
		return HAL_ERR_PARA;
	}

	if (sgpio_index >= Sgpio_Max_Id) {
		//dbg_printf("hal_sgpio_init_rtl8195bhp: Invalid sgpio Index(&d)\r\n", sgpio_index);
		return HAL_ERR_PARA;
	}

	psgpio_adp->sgpio_sclk_ns = SGPIO_HP_SCLK_NS;

	hal_rom_sgpio_irq_reg();
	for (i = 0; i < Sgpio_Max_Id; i++) {
		if (sgpio_group_adapter.irq_fun[i] != NULL) {
			break;
		}
	}

	if (i == Sgpio_Max_Id) {
		hal_irq_set_priority(SGPIO_IRQn, SGPIO_IRQPri);
	}

	switch (psgpio_adp->sgpio_index) {
	case Sgpio0_Sel:
		psgpio_adp->base_addr = (SGPIO_Type *)SGPIO_REG_BASE;
		sgpio_group_adapter.irq_fun[0] = hal_rom_sgpio_irq_handler;
		sgpio_group_adapter.psgpio_adapter[0] = psgpio_adp;
		break;

	default:
		return HAL_ERR_PARA;
	}


	hal_rom_sgpio_en_ctrl(sgpio_index, ENABLE);

	//Reg dcache app
	psgpio_adp->dcache_clean_by_addr = hal_cache_stubs.dcache_clean_by_addr;

	// Clear all interrupt status: write clear
	psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	psgpio_reg->SGPIO_IS = 0x0FFF;

	return ret;
}

/**
 *  @brief De-initialize of the sgpio hardware and turn off the SGPIO.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_deinit(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	// Clear all interrupt status: write clear
	psgpio_reg->SGPIO_IS = 0x0FFF;

	hal_rom_sgpio_en_ctrl(psgpio_adp->sgpio_index, DISABLE);
	hal_rom_sgpio_unreg(psgpio_adp);
}

/**
*  @brief To enter a critical code section, mainly it
*         disable the SGPIO interrupt to prevent race condition.
*
*  @returns void
*/
SECTION_SGPIO_TEXT
void hal_rom_sgpio_enter_critical(void)
{
	if (__get_IPSR() == (SGPIO_IRQn + 16)) {
		// In an ISR
		return;
	}

	hal_irq_disable(SGPIO_IRQn);
	__ISB();
	sgpio_group_adapter.critical_lv++;
	__DSB();

