Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
}

/**
 *  @brief To exit a critical code section, it will re-enable the SGPIO interrupt
 *         only when the exiting critical section is the top level.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_exit_critical(void)
{
	if (__get_IPSR() == (SGPIO_IRQn + 16)) {
		// In an ISR
		return;
	}

	if (sgpio_group_adapter.critical_lv > 0) {
		sgpio_group_adapter.critical_lv--;
		__DSB();
		if (sgpio_group_adapter.critical_lv == 0) {
			hal_irq_enable(SGPIO_IRQn);
			__ISB();
		}
	}

}

/**
 *  @brief  Set the stop events to make the rxtc timer stop.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  prxtc_event The stop events. 0: disable, 1: enable.
 *                      rxtc_match_event0 - This event is that the rx timer value matches rx match register 0.
 *                      rxtc_match_event1 - This event is that the rx timer value matches rx match register 1.
 *                      rxtc_match_event2 - This event is that the rx timer value matches rx match register 2.
 *                      multc_match_event0 - This event is that the multc timer value matches Multiple Match Register 0.
 *                      rx_postc_zero - This event is that the rxpostc register becomes 0.
 *                      capture_event - This event is that happen the capture.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_rxtc_stop_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_event_t *prxtc_event)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 temp_reg;

	temp_reg = psgpio_reg->SGPIO_RXMC;
	temp_reg &= ~(SGPIO_BIT_RX_MR0STOP_EN | SGPIO_BIT_RX_MR1STOP_EN | SGPIO_BIT_RX_MR2STOP_EN | SGPIO_BIT_RX_POSSTOP_EN);
	temp_reg |= (prxtc_event->rxtc_match_event0 << SGPIO_SHIFT_RX_MR0STOP_EN);
	temp_reg |= (prxtc_event->rxtc_match_event1 << SGPIO_SHIFT_RX_MR1STOP_EN);
	temp_reg |= (prxtc_event->rxtc_match_event2 << SGPIO_SHIFT_RX_MR2STOP_EN);
	temp_reg |= (prxtc_event->rx_postc_zero << SGPIO_SHIFT_RX_POSSTOP_EN);
	psgpio_reg->SGPIO_RXMC = temp_reg;

	temp_reg = psgpio_reg->SGPIO_MULMC;
	temp_reg &= ~(SGPIO_BIT_MUL_MR0RXSTOP_EN);
	temp_reg |= (prxtc_event->multc_match_event0 << SGPIO_SHIFT_MUL_MR0RXSTOP_EN);
	psgpio_reg->SGPIO_MULMC = temp_reg;

	temp_reg = psgpio_reg->SGPIO_CAP_CTRL;
	temp_reg &= ~(SGPIO_BIT_CAP_RXTCSTOP_EN);
	temp_reg |= (prxtc_event->capture_event << SGPIO_SHIFT_CAP_RXTCSTOP_EN);
	psgpio_reg->SGPIO_CAP_CTRL = temp_reg;

}

/**
 *  @brief  Update the rxtc stop events of the SGPIO adapter according to the SGPIO registers.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  prxtc_event The stop events.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_get_rxtc_stop_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_event_t *prxtc_event)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 temp_reg;

	temp_reg = psgpio_reg->SGPIO_RXMC;
	prxtc_event->rxtc_match_event0 = (temp_reg & SGPIO_BIT_RX_MR0STOP_EN) >> SGPIO_SHIFT_RX_MR0STOP_EN;
	prxtc_event->rxtc_match_event1 = (temp_reg & SGPIO_BIT_RX_MR1STOP_EN) >> SGPIO_SHIFT_RX_MR1STOP_EN;
	prxtc_event->rxtc_match_event2 = (temp_reg & SGPIO_BIT_RX_MR2STOP_EN) >> SGPIO_SHIFT_RX_MR2STOP_EN;
	prxtc_event->rx_postc_zero = (temp_reg & SGPIO_BIT_RX_POSSTOP_EN) >> SGPIO_SHIFT_RX_POSSTOP_EN;

	temp_reg = psgpio_reg->SGPIO_MULMC;
	prxtc_event->multc_match_event0 = (temp_reg & SGPIO_BIT_MUL_MR0RXSTOP_EN) >> SGPIO_SHIFT_MUL_MR0RXSTOP_EN;

	temp_reg = psgpio_reg->SGPIO_CAP_CTRL;
	prxtc_event->capture_event = (temp_reg & SGPIO_BIT_CAP_RXTCSTOP_EN) >> SGPIO_SHIFT_CAP_RXTCSTOP_EN;

}

/**
 *  @brief  Set the reset events to make the rxtc timer reset.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  prxtc_event The reset events. 0: disable, 1: enable.
 *                      rxtc_match_event0 - This event is that the rx timer value matches rx match register 0.
 *                      rxtc_match_event1 - This event is that the rx timer value matches rx match register 1.
 *                      rxtc_match_event2 - This event is that the rx timer value matches rx match register 2.
 *                      multc_match_event0 - This event is that the multc timer value matches Multiple Match Register 0.
 *                      rx_postc_zero - This event is that the rxpostc register becomes 0.
 *                      capture_event - This event is that happen the capture.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_rxtc_reset_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_event_t *prxtc_event)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 temp_reg;

	temp_reg = psgpio_reg->SGPIO_RXMC;
	temp_reg &= ~(SGPIO_BIT_RX_MR0RST_EN | SGPIO_BIT_RX_MR1RST_EN | SGPIO_BIT_RX_MR2RST_EN | SGPIO_BIT_RX_POSRST_EN);
	temp_reg |= (prxtc_event->rxtc_match_event0 << SGPIO_SHIFT_RX_MR0RST_EN);
	temp_reg |= (prxtc_event->rxtc_match_event1 << SGPIO_SHIFT_RX_MR1RST_EN);
	temp_reg |= (prxtc_event->rxtc_match_event2 << SGPIO_SHIFT_RX_MR2RST_EN);
	temp_reg |= (prxtc_event->rx_postc_zero << SGPIO_SHIFT_RX_POSRST_EN);
	psgpio_reg->SGPIO_RXMC = temp_reg;

	temp_reg = psgpio_reg->SGPIO_MULMC;
	temp_reg &= ~(SGPIO_BIT_MUL_MR0RXRST_EN);
	temp_reg |= (prxtc_event->multc_match_event0 << SGPIO_SHIFT_MUL_MR0RXRST_EN);
	psgpio_reg->SGPIO_MULMC = temp_reg;

	temp_reg = psgpio_reg->SGPIO_CAP_CTRL;
	temp_reg &= ~(SGPIO_BIT_CAP_RXTCRST_EN);
	temp_reg |= (prxtc_event->capture_event << SGPIO_SHIFT_CAP_RXTCRST_EN);
	psgpio_reg->SGPIO_CAP_CTRL = temp_reg;

}

/**
 *  @brief  Update the rxtc reset events of the SGPIO adapter according to the SGPIO registers.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  prxtc_event The reset events.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_get_rxtc_reset_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_event_t *prxtc_event)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 temp_reg;

	temp_reg = psgpio_reg->SGPIO_RXMC;
	prxtc_event->rxtc_match_event0 = (temp_reg & SGPIO_BIT_RX_MR0RST_EN) >> SGPIO_SHIFT_RX_MR0RST_EN;
	prxtc_event->rxtc_match_event1 = (temp_reg & SGPIO_BIT_RX_MR1RST_EN) >> SGPIO_SHIFT_RX_MR1RST_EN;
	prxtc_event->rxtc_match_event2 = (temp_reg & SGPIO_BIT_RX_MR2RST_EN) >> SGPIO_SHIFT_RX_MR2RST_EN;
	prxtc_event->rx_postc_zero = (temp_reg & SGPIO_BIT_RX_POSRST_EN) >> SGPIO_SHIFT_RX_POSRST_EN;

	temp_reg = psgpio_reg->SGPIO_MULMC;
	prxtc_event->multc_match_event0 = (temp_reg & SGPIO_BIT_MUL_MR0RXRST_EN) >> SGPIO_SHIFT_MUL_MR0RXRST_EN;

