Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	temp_reg = psgpio_reg->SGPIO_CAP_CTRL;
	prxtc_event->capture_event = (temp_reg & SGPIO_BIT_CAP_RXTCRST_EN) >> SGPIO_SHIFT_CAP_RXTCRST_EN;
}

/**
 *  @brief  Set the register value of the rxtc match event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_event Select the rxtc match event.
 *  @param[in]  match_value The match value of the register value.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_rxtc_match_value(hal_sgpio_adapter_t *psgpio_adp, sgpio_rxtc_match_event_t match_event, u16 match_value)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	if (match_event == Rxtc_MatchEvent0) {
		psgpio_reg->SGPIO_RXMR0 = (match_value & SGPIO_MASK_RXMR0);
	} else if (match_event == Rxtc_MatchEvent1) {
		psgpio_reg->SGPIO_RXMR1 = (match_value & SGPIO_MASK_RXMR1);
	} else if (match_event == Rxtc_MatchEvent2) {
		psgpio_reg->SGPIO_RXMR2 = (match_value & SGPIO_MASK_RXMR2);
	}
}

/**
 *  @brief  Set the interrupt control of the rxtc match event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_event Select the rxtc match event.
 *  @param[in]  psgpio_set_irq The parameter structure is for initializing the interrupt event.
 *                      int_en - 0: disbale this event interrupt, 1: enable.
 *                      imr_en - 0: disbale mask event interrupt, 1: enable.
 *                      callback_reg_en - 0: don't register this callback function, 1: register this callback function.
 *                      callback - The callback function.
 *                      arg - The callback argument.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_rxtc_int(hal_sgpio_adapter_t *psgpio_adp,  sgpio_rxtc_match_event_t match_event, hal_sgpio_set_irq_t *psgpio_set_irq)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u8 irq_bit_shift = 0;
	u32 rxmc_temp;
	u32 reg_temp;

	rxmc_temp = psgpio_reg->SGPIO_RXMC;

	if (match_event == Rxtc_MatchEvent0) {
		reg_temp = psgpio_reg->SGPIO_IM;
		reg_temp &= ~(SGPIO_BIT_RX_MR0I_IM);
		reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_RX_MR0I_IM);
		psgpio_reg->SGPIO_IM = reg_temp;

		rxmc_temp &= ~(SGPIO_BIT_RX_MR0I_EN);
		rxmc_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_RX_MR0I_EN);
		irq_bit_shift = Rx_Mr0_Sft;
	} else if (match_event == Rxtc_MatchEvent1) {
		reg_temp = psgpio_reg->SGPIO_IM;
		reg_temp &= ~(SGPIO_BIT_RX_MR1I_IM);
		reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_RX_MR1I_IM);
		psgpio_reg->SGPIO_IM = reg_temp;

		rxmc_temp &= ~(SGPIO_BIT_RX_MR1I_EN);
		rxmc_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_RX_MR1I_EN);
		irq_bit_shift = Rx_Mr1_Sft;
	} else if (match_event == Rxtc_MatchEvent2) {
		reg_temp = psgpio_reg->SGPIO_IM;
		reg_temp &= ~(SGPIO_BIT_RX_MR2I_IM);
		reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_RX_MR2I_IM);
		psgpio_reg->SGPIO_IM = reg_temp;

		rxmc_temp &= ~(SGPIO_BIT_RX_MR2I_EN);
		rxmc_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_RX_MR2I_EN);
		irq_bit_shift = Rx_Mr2_Sft;
	}

	psgpio_reg->SGPIO_RXMC = rxmc_temp;

	if (psgpio_set_irq->callback_reg_en == 1) {
		hal_rom_sgpio_reg_cb(psgpio_adp, psgpio_set_irq->callback, psgpio_set_irq->arg, irq_bit_shift);
	} else {
		hal_rom_sgpio_unreg_cb(psgpio_adp, irq_bit_shift);
	}
}

/**
 *  @brief  Set the capture event control.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  capture_type Select the capture event.
 *  @param[in]  cap_en Enable or Disable the capture function
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_capture_ctrl(hal_sgpio_adapter_t *psgpio_adp, sgpio_capture_type_t capture_type, BOOL cap_en)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 cap_ctrl_temp;

	cap_ctrl_temp = psgpio_reg->SGPIO_CAP_CTRL;
	cap_ctrl_temp &= ~(SGPIO_BIT_CAPFE_EN | SGPIO_BIT_CAPRE_EN | SGPIO_BIT_CAPSRC_SEL | SGPIO_BIT_CAPVALID_EN);

	psgpio_reg->SGPIO_MULMC &= ~(SGPIO_BIT_MUL_MR0CAPSRC_EN);

	if (capture_type == Cap_InputRiseEg) {
		cap_ctrl_temp |= (1 << SGPIO_SHIFT_CAPRE_EN);
	} else if (capture_type == Cap_InputFallEg) {
		cap_ctrl_temp |= (1 << SGPIO_SHIFT_CAPFE_EN);
	} else if (capture_type == Cap_InputBothEg) {
		cap_ctrl_temp |= ((1 << SGPIO_SHIFT_CAPRE_EN) | (1 << SGPIO_SHIFT_CAPFE_EN));
	} else if (capture_type == Cap_MultcMatchEvent0) {
		cap_ctrl_temp |= (1 << SGPIO_SHIFT_CAPSRC_SEL);
		psgpio_reg->SGPIO_MULMC |= (1 << SGPIO_SHIFT_MUL_MR0CAPSRC_EN);
	}

	cap_ctrl_temp &= ~(SGPIO_BIT_CAP_EN);
	cap_ctrl_temp |= (cap_en << SGPIO_SHIFT_CAP_EN);

	psgpio_reg->SGPIO_CAP_CTRL = cap_ctrl_temp;

}

/**
 *  @brief  Translate the capture value into "0" or "1" according to the result of the comparison.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  cap_cmpval_sel Set that the rxdata register receives value 0 or 1 when the capture value is bigger than cap_cmpval.
 *  @param[in]  cap_cmpval The compare value.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_capture_compare(hal_sgpio_adapter_t *psgpio_adp, u8 cap_cmpval_sel, u16 cap_cmpval)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_CAP_CTRL;
	reg_temp &= ~(SGPIO_BIT_CAP_CMPVAL_SEL | SGPIO_MASK_CAP_CMPVAL);
	reg_temp |= ((cap_cmpval_sel << SGPIO_SHIFT_CAP_CMPVAL_SEL) | (cap_cmpval << SGPIO_SHIFT_CAP_CMPVAL));
	psgpio_reg->SGPIO_CAP_CTRL = reg_temp;
}

/**
 *  @brief  Set the interrupt control of the capture event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_set_irq The parameter structure is for initializing the interrupt event.
 *                      int_en - 0: disbale this event interrupt, 1: enable.
 *                      imr_en - 0: disbale mask event interrupt, 1: enable.
 *                      callback_reg_en - 0: don't register this callback function, 1: register this callback function.
 *                      callback - The callback function.
 *                      arg - The callback argument.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_capture_int(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_set_irq_t *psgpio_set_irq)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_IM;
	reg_temp &= ~(SGPIO_BIT_CAPI_IM);
	reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_CAPI_IM);
	psgpio_reg->SGPIO_IM = reg_temp;

	reg_temp = psgpio_reg->SGPIO_CAP_CTRL;
	reg_temp &= ~(SGPIO_BIT_CAPI_EN);
	reg_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_CAPI_EN);
	psgpio_reg->SGPIO_CAP_CTRL = reg_temp;

