Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	if (psgpio_set_irq->callback_reg_en == 1) {
		hal_rom_sgpio_reg_cb(psgpio_adp, psgpio_set_irq->callback, psgpio_set_irq->arg, Cap_Sft);
	} else {
		hal_rom_sgpio_unreg_cb(psgpio_adp, Cap_Sft);
	}

}

/**
 *  @brief  Set the stop events to make the multc timer stop.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  pmultc_event The stop events. 0: disable, 1: enable.
 *                      multc_match_event0 - This event is that the multc timer value matches multiple match register 0.
 *                      rxtc_match_event0 - This event is that the rx timer value matches rx match register 0.
 *                      multc_mcnt_zero - This event is that the mul_mcnt register becomes 0.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_multc_stop_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_event_t *pmultc_event)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp &= ~(SGPIO_BIT_MUL_MR0STOP_EN | SGPIO_BIT_MUL_MCNTSTOP_EN);
	reg_temp |= (pmultc_event->multc_match_event0 << SGPIO_SHIFT_MUL_MR0STOP_EN);
	reg_temp |= (pmultc_event->multc_mcnt_zero << SGPIO_SHIFT_MUL_MCNTSTOP_EN);
	psgpio_reg->SGPIO_MULMC = reg_temp;

	reg_temp = psgpio_reg->SGPIO_RXMC;
	reg_temp &= ~(SGPIO_BIT_RX_MR0MULSTOP_EN);
	reg_temp |= (pmultc_event->rxtc_match_event0 << SGPIO_SHIFT_RX_MR0MULSTOP_EN);
	psgpio_reg->SGPIO_RXMC = reg_temp;

}

/**
 *  @brief  Update the multc stop events of the SGPIO adapter according to the SGPIO registers.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  pmultc_event The stop events.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_get_multc_stop_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_event_t *pmultc_event)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	pmultc_event->multc_match_event0 = (reg_temp & SGPIO_BIT_MUL_MR0STOP_EN) >> SGPIO_SHIFT_MUL_MR0STOP_EN;
	pmultc_event->multc_mcnt_zero = (reg_temp & SGPIO_BIT_MUL_MCNTSTOP_EN) >> SGPIO_SHIFT_MUL_MCNTSTOP_EN;

	reg_temp = psgpio_reg->SGPIO_RXMC;
	pmultc_event->rxtc_match_event0 = (reg_temp & SGPIO_BIT_RX_MR0MULSTOP_EN) >> SGPIO_SHIFT_RX_MR0MULSTOP_EN;
}

/**
 *  @brief  Set the reset events to make the multc timer reset.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  pmultc_event The reset events. 0: disable, 1: enable.
 *                      multc_match_event0 - This event is that the multc timer value matches multiple match register 0.
 *                      rxtc_match_event0 - This event is that the rx timer value matches rx match register 0.
 *                      multc_mcnt_zero - This event is that the mul_mcnt register becomes 0.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_multc_reset_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_event_t *pmultc_event)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp &= ~(SGPIO_BIT_MUL_MR0RST_EN | SGPIO_BIT_MUL_MCNTRST_EN);
	reg_temp |= (pmultc_event->multc_match_event0 << SGPIO_SHIFT_MUL_MR0RST_EN);
	reg_temp |= (pmultc_event->multc_mcnt_zero << SGPIO_SHIFT_MUL_MCNTRST_EN);
	psgpio_reg->SGPIO_MULMC = reg_temp;

	reg_temp = psgpio_reg->SGPIO_RXMC;
	reg_temp &= ~(SGPIO_BIT_RX_MR0MULRST_EN);
	reg_temp |= (pmultc_event->rxtc_match_event0 << SGPIO_SHIFT_RX_MR0MULRST_EN);
	psgpio_reg->SGPIO_RXMC = reg_temp;

}

/**
 *  @brief  Update the multc reset events of the SGPIO adapter according to the SGPIO registers.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  pmultc_event The reset events.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_get_multc_reset_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_event_t *pmultc_event)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	pmultc_event->multc_match_event0 = (reg_temp & SGPIO_BIT_MUL_MR0RST_EN) >> SGPIO_SHIFT_MUL_MR0RST_EN;
	pmultc_event->multc_mcnt_zero = (reg_temp & SGPIO_BIT_MUL_MCNTRST_EN) >> SGPIO_SHIFT_MUL_MCNTRST_EN;

	reg_temp = psgpio_reg->SGPIO_RXMC;
	pmultc_event->rxtc_match_event0 = (reg_temp & SGPIO_BIT_RX_MR0MULRST_EN) >> SGPIO_SHIFT_RX_MR0MULRST_EN;
}

/**
 *  @brief  Set the register value of the multc match event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_group Select the group of the multc match event.
 *  @param[in]  match_event Select the multc match event.
 *  @param[in]  match_value The match value of the register value.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_multc_match_value(hal_sgpio_adapter_t *psgpio_adp, sgpio_multc_match_group_t match_group, sgpio_multc_match_event_t match_event,
		u16 match_value)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	if (match_group == Multc_MatchGroup0) {
		if (match_event == Multc_MatchEvent0) {
			reg_temp = psgpio_reg->SGPIO_MULMR01GP0;
			reg_temp &= ~(SGPIO_MASK_MULMR0_GP0);
			reg_temp |= (match_value << SGPIO_SHIFT_MULMR0_GP0);
			psgpio_reg->SGPIO_MULMR01GP0 = reg_temp;
		} else if (match_event == Multc_MatchEvent1) {
			reg_temp = psgpio_reg->SGPIO_MULMR01GP0;
			reg_temp &= ~(SGPIO_MASK_MULMR1_GP0);
			reg_temp |= (match_value << SGPIO_SHIFT_MULMR1_GP0);
			psgpio_reg->SGPIO_MULMR01GP0 = reg_temp;
		} else if (match_event == Multc_MatchEvent2) {
			reg_temp = psgpio_reg->SGPIO_MULMR23GP0;
			reg_temp &= ~(SGPIO_MASK_MULMR2_GP0);
			reg_temp |= (match_value << SGPIO_SHIFT_MULMR2_GP0);
			psgpio_reg->SGPIO_MULMR23GP0 = reg_temp;
		} else if (match_event == Multc_MatchEvent3) {
			reg_temp = psgpio_reg->SGPIO_MULMR23GP0;
			reg_temp &= ~(SGPIO_MASK_MULMR3_GP0);
			reg_temp |= (match_value << SGPIO_SHIFT_MULMR3_GP0);
			psgpio_reg->SGPIO_MULMR23GP0 = reg_temp;
		}
	} else if (match_group == Multc_MatchGroup1) {
		if (match_event == Multc_MatchEvent0) {
			reg_temp = psgpio_reg->SGPIO_MULMR01GP1;
			reg_temp &= ~(SGPIO_MASK_MULMR0_GP1);
			reg_temp |= (match_value << SGPIO_SHIFT_MULMR0_GP1);
			psgpio_reg->SGPIO_MULMR01GP1 = reg_temp;
		} else if (match_event == Multc_MatchEvent1) {
			reg_temp = psgpio_reg->SGPIO_MULMR01GP1;
			reg_temp &= ~(SGPIO_MASK_MULMR1_GP1);
			reg_temp |= (match_value << SGPIO_SHIFT_MULMR1_GP1);
			psgpio_reg->SGPIO_MULMR01GP1 = reg_temp;
		} else if (match_event == Multc_MatchEvent2) {
			reg_temp = psgpio_reg->SGPIO_MULMR23GP1;
			reg_temp &= ~(SGPIO_MASK_MULMR2_GP1);
			reg_temp |= (match_value << SGPIO_SHIFT_MULMR2_GP1);
			psgpio_reg->SGPIO_MULMR23GP1 = reg_temp;
		} else if (match_event == Multc_MatchEvent3) {
			reg_temp = psgpio_reg->SGPIO_MULMR23GP1;
			reg_temp &= ~(SGPIO_MASK_MULMR3_GP1);
			reg_temp |= (match_value << SGPIO_SHIFT_MULMR3_GP1);
			psgpio_reg->SGPIO_MULMR23GP1 = reg_temp;
		}
	}

