Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
}

/**
 *  @brief  Set the interrupt control of the multc match event 0.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_set_irq The parameter structure is for initializing the interrupt event.
 *                      int_en - 0: disbale this event interrupt, 1: enable.
 *                      imr_en - 0: disbale mask event interrupt, 1: enable.
 *                      callback_reg_en - 0: don't register this callback function, 1: register this callback function.
 *                      callback - The callback function.
 *                      arg - The callback argument.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_multc_match_event0_int(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_set_irq_t *psgpio_set_irq)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_IM;
	reg_temp &= ~(SGPIO_BIT_MUL_MR0I_IM);
	reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_MUL_MR0I_IM);
	psgpio_reg->SGPIO_IM = reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp &= ~(SGPIO_BIT_MUL_MR0I_EN);
	reg_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_MUL_MR0I_EN);
	psgpio_reg->SGPIO_MULMC = reg_temp;

	if (psgpio_set_irq->callback_reg_en == 1) {
		hal_rom_sgpio_reg_cb(psgpio_adp, psgpio_set_irq->callback, psgpio_set_irq->arg, Mul_Mr0_Sft);
	} else {
		hal_rom_sgpio_unreg_cb(psgpio_adp, Mul_Mr0_Sft);
	}

}

/**
 *  @brief  Select the group of the multc match event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_group The group of the multc match event.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_multc_match_group(hal_sgpio_adapter_t *psgpio_adp, sgpio_multc_match_group_t match_group)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;
	u32 muldata;
	u32 muldata_mask;

	reg_temp = (psgpio_reg->SGPIO_DATA_CTRL & SGPIO_BIT_TXDATA_DIR) >> SGPIO_SHIFT_TXDATA_DIR;

	if (reg_temp == 0x00) {
		muldata_mask = 0x01;
	} else {
		muldata_mask = 0x80000000;
	}

	muldata = psgpio_reg->SGPIO_MULDATA & ~(muldata_mask);

	if (match_group == Multc_MatchGroup1) {
		muldata = muldata | muldata_mask;
	}

	psgpio_reg->SGPIO_MULDATA = muldata;
}

/**
 *  @brief  Set the register value of the multc match event by using the FIFO mode.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  pfifo_value The multc match event when use the FIFO mode.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_multc_fifo_value(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_fifo_value_t *pfifo_value)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	psgpio_reg->SGPIO_MULFDATA = (u32)pfifo_value->multc_match_event0_val | (u32)((u32)pfifo_value->multc_match_event1_val << 16);
	psgpio_reg->SGPIO_MULFDATA = (u32)pfifo_value->multc_match_event2_val | (u32)((u32)pfifo_value->multc_match_event3_val << 16);
}

/**
 *  @brief  Set the external output for the rxtc match event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_event Select the rxtc match event.
 *  @param[in]  external_output Set the output state when happen the rxtc match event.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_rxtc_external_match(hal_sgpio_adapter_t *psgpio_adp, sgpio_rxtc_match_event_t match_event, sgpio_external_output_t external_output)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULEMR;

	if (match_event == Rxtc_MatchEvent0) {
		reg_temp &= ~(SGPIO_MASK_RXEMC0);
		reg_temp |= (external_output << SGPIO_SHIFT_RXEMC0);
	} else if (match_event == Rxtc_MatchEvent1) {
		reg_temp &= ~(SGPIO_MASK_RXEMC1);
		reg_temp |= (external_output << SGPIO_SHIFT_RXEMC1);
	} else if (match_event == Rxtc_MatchEvent2) {
		reg_temp &= ~(SGPIO_MASK_RXEMC2);
		reg_temp |= (external_output << SGPIO_SHIFT_RXEMC2);
	}

	psgpio_reg->SGPIO_MULEMR = reg_temp;

}

/**
 *  @brief  Set the external output for the multc match event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_event Select the multc match event.
 *  @param[in]  external_output Set the output state when happen the multc match event.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_multc_external_match(hal_sgpio_adapter_t *psgpio_adp, sgpio_multc_match_event_t match_event, sgpio_external_output_t external_output)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULEMR;

	if (match_event == Multc_MatchEvent0) {
		//dbg_printf("hal_sgpio_set_multc_external_match_rtl8195bhp: Not support Multc_MatchEvent0 \r\n");
	} else if (match_event == Multc_MatchEvent1) {
		reg_temp &= ~(SGPIO_MASK_MULEMC1);
		reg_temp |= (external_output << SGPIO_SHIFT_MULEMC1);
	} else if (match_event == Multc_MatchEvent2) {
		reg_temp &= ~(SGPIO_MASK_MULEMC2);
		reg_temp |= (external_output << SGPIO_SHIFT_MULEMC2);
	} else if (match_event == Multc_MatchEvent3) {
		reg_temp &= ~(SGPIO_MASK_MULEMC3);
		reg_temp |= (external_output << SGPIO_SHIFT_MULEMC3);
	}

	psgpio_reg->SGPIO_MULEMR = reg_temp;

}

/**
 *  @brief  Set the control and interrupt for counting multc match event 0.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_cnt_en Enable or Disable to count the multc match event 0.
 *  @param[in]  match_down_cnt Set the countdown value. When match_down_cnt is zero, make the interrupt.
 *  @param[in]  psgpio_set_irq The parameter structure is for initializing the interrupt event.
 *                      int_en - 0: disbale this event interrupt, 1: enable.
 *                      imr_en - 0: disbale mask event interrupt, 1: enable.
 *                      callback_reg_en - 0: don't register this callback function, 1: register this callback function.
 *                      callback - The callback function.
 *                      arg - The callback argument.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_multc_match_event0_cnt_int(hal_sgpio_adapter_t *psgpio_adp, BOOL match_cnt_en, u8 match_down_cnt, hal_sgpio_set_irq_t *psgpio_set_irq)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

