Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	if (match_down_cnt != 0x00) {
		reg_temp = psgpio_reg->SGPIO_MUL_MCNT;
		reg_temp &= ~(SGPIO_MASK_MUL_MCNT);
		reg_temp |= ((match_down_cnt - 1) << SGPIO_SHIFT_MUL_MCNT);
		psgpio_reg->SGPIO_MUL_MCNT = reg_temp;
	} else {
		psgpio_reg->SGPIO_MUL_MCNT = 0;
	}

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp &= ~(SGPIO_BIT_MUL_MR0MCNT_EN);
	reg_temp |= (match_cnt_en << SGPIO_SHIFT_MUL_MR0MCNT_EN);
	psgpio_reg->SGPIO_MULMC = reg_temp;

	reg_temp = psgpio_reg->SGPIO_IM;
	reg_temp &= ~(SGPIO_BIT_MULMCNT_IM);
	reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_MULMCNT_IM);
	psgpio_reg->SGPIO_IM = reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp &= ~(SGPIO_BIT_MUL_MCNTI_EN);
	reg_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_MUL_MCNTI_EN);
	psgpio_reg->SGPIO_MULMC = reg_temp;

	if (psgpio_set_irq->callback_reg_en == 1) {
		hal_rom_sgpio_reg_cb(psgpio_adp, psgpio_set_irq->callback, psgpio_set_irq->arg, Mulmcnt_Sft);
	} else {
		hal_rom_sgpio_unreg_cb(psgpio_adp, Mulmcnt_Sft);
	}
}

/**
 *  @brief  Set the control for counting multc match event 0.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_cnt_en Enable or Disable to count the multc match event 0.
 *  @param[in]  match_down_cnt Set the countdown value. When match_down_cnt is zero, make the interrupt.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_multc_match_event0_cnt(hal_sgpio_adapter_t *psgpio_adp, BOOL match_cnt_en, u8 match_down_cnt)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	if (match_down_cnt != 0x00) {
		reg_temp = psgpio_reg->SGPIO_MUL_MCNT;
		reg_temp &= ~(SGPIO_MASK_MUL_MCNT);
		reg_temp |= ((match_down_cnt - 1) << SGPIO_SHIFT_MUL_MCNT);
		psgpio_reg->SGPIO_MUL_MCNT = reg_temp;
	} else {
		psgpio_reg->SGPIO_MUL_MCNT = 0;
	}

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp &= ~(SGPIO_BIT_MUL_MR0MCNT_EN);
	reg_temp |= (match_cnt_en << SGPIO_SHIFT_MUL_MR0MCNT_EN);
	psgpio_reg->SGPIO_MULMC = reg_temp;

}

/**
 *  @brief  Set the smapling event for rxdata.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psampling_event The smapling events. 0: disable, 1: enable.
 *                      rxtc_match_event0 - This event is that the rx timer value matches rx match register 0.
 *                      rxtc_match_event1 - This event is that the rx timer value matches rx match register 1.
 *                      rxtc_match_event2 - This event is that the rx timer value matches rx match register 2.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_init_rxdata_time_sampling(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_sampling_event_t *psampling_event)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_RXMC;

	if (psampling_event->rxtc_match_event0 == 1) {
		reg_temp |= SGPIO_BIT_RX_MR0SCLK_EN;
	} else {
		reg_temp &= ~(SGPIO_BIT_RX_MR0SCLK_EN);
	}

	if (psampling_event->rxtc_match_event1 == 1) {
		reg_temp |= SGPIO_BIT_RX_MR1SCLK_EN;
	} else {
		reg_temp &= ~(SGPIO_BIT_RX_MR1SCLK_EN);
	}

	if (psampling_event->rxtc_match_event2 == 1) {
		reg_temp |= SGPIO_BIT_RX_MR2SCLK_EN;
	} else {
		reg_temp &= ~(SGPIO_BIT_RX_MR2SCLK_EN);
	}

	psgpio_reg->SGPIO_RXMC = reg_temp;

	psgpio_reg->SGPIO_DATA_CTRL &= ~(SGPIO_BIT_RXDATASRC_SEL);

}

/**
 *  @brief  Disable the smapling event for rxdata.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_deinit_rxdata_time_sampling(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_RXMC;
	reg_temp &= ~(SGPIO_BIT_RX_MR0SCLK_EN);
	reg_temp &= ~(SGPIO_BIT_RX_MR1SCLK_EN);
	reg_temp &= ~(SGPIO_BIT_RX_MR2SCLK_EN);
	psgpio_reg->SGPIO_RXMC = reg_temp;

	psgpio_reg->SGPIO_DATA_CTRL &= ~(SGPIO_BIT_RXDATASRC_SEL);

}

/**
 *  @brief  Initialize that the rxdata source is the capture compare result.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  cmp_result_bit Set that the rxdata register receives value 0 or 1 when the capture value is bigger than cap_cmpval.
 *  @param[in]  cap_cmpval The compare value. This unit is count.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_init_rxdata_capture_compare(hal_sgpio_adapter_t *psgpio_adp, sgpio_cmp_result_bit_t cmp_result_bit, u16 cap_cmpval)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	hal_rom_sgpio_set_capture_compare(psgpio_adp, cmp_result_bit, cap_cmpval);

	psgpio_reg->SGPIO_DATA_CTRL |= SGPIO_BIT_RXDATASRC_SEL;
}

/**
 *  @brief  De-initialize that the rxdata source is the capture compare result.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_deinit_rxdata_capture_compare(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	hal_rom_sgpio_set_capture_ctrl(psgpio_adp, Cap_None, 0);
	hal_rom_sgpio_set_capture_compare(psgpio_adp, 0, 0);

	psgpio_reg->SGPIO_DATA_CTRL &= ~(SGPIO_BIT_RXDATASRC_SEL);
}

/**
 *  @brief  Set the rxdata sampling length and interrupt. When reach the length to be received, generate the interrupt.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  bit_length The sampling bit length.
 *  @param[in]  psgpio_set_irq The parameter structure is for initializing the interrupt event.
 *                      int_en - 0: disbale this event interrupt, 1: enable.
 *                      imr_en - 0: disbale mask event interrupt, 1: enable.
 *                      callback_reg_en - 0: don't register this callback function, 1: register this callback function.
 *                      callback - The callback function.
 *                      arg - The callback argument.
 *
 *  @return     HAL_ERR_PARA
 *  @return     HAL_OK
 */
SECTION_SGPIO_TEXT
HAL_Status hal_rom_sgpio_set_rxdata_load_int(hal_sgpio_adapter_t *psgpio_adp, u8 bit_length, hal_sgpio_set_irq_t *psgpio_set_irq)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

