Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	if (bit_length > 32) {
		//dbg_printf("hal_sgpio_set_rxdata_load_int_rtl8195bhp: bit_cnt > 32 \r\n");
		return HAL_ERR_PARA;
	} else {
		if (bit_length != 0x00) {
			reg_temp = psgpio_reg->SGPIO_RXPOSR;
			reg_temp &= ~(SGPIO_MASK_RXPOSRST);
			reg_temp |= ((bit_length - 1) << SGPIO_SHIFT_RXPOSRST);
			psgpio_reg->SGPIO_RXPOSR = reg_temp;

			reg_temp = psgpio_reg->SGPIO_RXPOSR;
			reg_temp &= ~(SGPIO_MASK_RXPOSTC);
			reg_temp |= ((bit_length - 1) << SGPIO_SHIFT_RXPOSTC);
			psgpio_reg->SGPIO_RXPOSR = reg_temp;

		} else {
			psgpio_reg->SGPIO_RXPOSR &= ~(SGPIO_MASK_RXPOSTC | SGPIO_MASK_RXPOSRST);
		}
	}

	reg_temp = psgpio_reg->SGPIO_IM;
	reg_temp &= ~(SGPIO_BIT_RXLOAD_IM);
	reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_RXLOAD_IM);
	psgpio_reg->SGPIO_IM = reg_temp;

	reg_temp = psgpio_reg->SGPIO_DATA_CTRL;
	reg_temp &= ~(SGPIO_BIT_RXLOAD_IE);
	reg_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_RXLOAD_IE);
	psgpio_reg->SGPIO_DATA_CTRL = reg_temp;

	if (psgpio_set_irq->callback_reg_en == 1) {
		hal_rom_sgpio_reg_cb(psgpio_adp, psgpio_set_irq->callback, psgpio_set_irq->arg, Rxload_Sft);
	} else {
		hal_rom_sgpio_unreg_cb(psgpio_adp, Rxload_Sft);
	}

	return HAL_OK;
}

/**
 *  @brief  Control the interrupt when happen the bit shift of rxdata.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_set_irq The parameter structure is for initializing the interrupt event.
 *                      int_en - 0: disbale this event interrupt, 1: enable.
 *                      imr_en - 0: disbale mask event interrupt, 1: enable.
 *                      callback_reg_en - 0: don't register this callback function, 1: register this callback function.
 *                      callback - The callback function.
 *                      arg - The callback argument.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_rxdata_prebuf_bit_shift_int(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_set_irq_t *psgpio_set_irq)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_IM;
	reg_temp &= ~(SGPIO_BIT_RXSFT_IM);
	reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_RXSFT_IM);
	psgpio_reg->SGPIO_IM = reg_temp;

	reg_temp = psgpio_reg->SGPIO_DATA_CTRL;
	reg_temp &= ~(SGPIO_BIT_RXSFT_IE);
	reg_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_RXSFT_IE);
	psgpio_reg->SGPIO_DATA_CTRL = reg_temp;

	if (psgpio_set_irq->callback_reg_en == 1) {
		hal_rom_sgpio_reg_cb(psgpio_adp, psgpio_set_irq->callback, psgpio_set_irq->arg, Rxsft_Sft);
	} else {
		hal_rom_sgpio_unreg_cb(psgpio_adp, Rxsft_Sft);
	}
}

/**
 *  @brief  Reset the rxdata.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_reset_rxdata(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	psgpio_reg->SGPIO_RXDATA = 0X00;
	psgpio_reg->SGPIO_RXDATA_DP = 0X00;
}

/**
 *  @brief  Set the control and interrupt for the rxdata match event.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  rxdata_match_en Enable or Disable to the rxdata match function.
 *  @param[in]  match_value Set the match value of rxdata.
 *  @param[in]  psgpio_set_irq The parameter structure is for initializing the interrupt event.
 *                      int_en - 0: disbale this event interrupt, 1: enable.
 *                      imr_en - 0: disbale mask event interrupt, 1: enable.
 *                      callback_reg_en - 0: don't register this callback function, 1: register this callback function.
 *                      callback - The callback function.
 *                      arg - The callback argument.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_rxdata_match_int(hal_sgpio_adapter_t *psgpio_adp, BOOL rxdata_match_en, u32 match_value, hal_sgpio_set_irq_t *psgpio_set_irq)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_DATA_CTRL;
	reg_temp &= ~(SGPIO_BIT_PATTERN_MATCH_MODE);
	reg_temp |= (rxdata_match_en << SGPIO_SHIFT_PATTERN_MATCH_MODE);
	psgpio_reg->SGPIO_DATA_CTRL = reg_temp;

	psgpio_reg->SGPIO_RXDATAMASK = 0xFFFFFFFF;
	psgpio_reg->SGPIO_RXDATA_DP = match_value;

	reg_temp = psgpio_reg->SGPIO_IM;
	reg_temp &= ~(SGPIO_BIT_PATTERN_MATCH_IM);
	reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_PATTERN_MATCH_IM);
	psgpio_reg->SGPIO_IM = reg_temp;

	reg_temp = psgpio_reg->SGPIO_DATA_CTRL;
	reg_temp &= ~(SGPIO_BIT_PATTERN_MATCH_IE);
	reg_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_PATTERN_MATCH_IE);
	psgpio_reg->SGPIO_DATA_CTRL = reg_temp;

	if (psgpio_set_irq->callback_reg_en == 1) {
		hal_rom_sgpio_reg_cb(psgpio_adp, psgpio_set_irq->callback, psgpio_set_irq->arg, Pattern_Match_Sft);
	} else {
		hal_rom_sgpio_unreg_cb(psgpio_adp, Pattern_Match_Sft);
	}
}

/**
 *  @brief  Set the txdata output length and interrupt. When reach the length to be sent, generate the interrupt.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  bit_length The output bit length.
 *  @param[in]  psgpio_set_irq The parameter structure is for initializing the interrupt event.
 *                      int_en - 0: disbale this event interrupt, 1: enable.
 *                      imr_en - 0: disbale mask event interrupt, 1: enable.
 *                      callback_reg_en - 0: don't register this callback function, 1: register this callback function.
 *                      callback - The callback function.
 *                      arg - The callback argument.
 *
 *  @return     HAL_ERR_PARA
 *  @return     HAL_OK
 */
SECTION_SGPIO_TEXT
HAL_Status hal_rom_sgpio_set_txdata_bit_length_int(hal_sgpio_adapter_t *psgpio_adp, u8 bit_length, hal_sgpio_set_irq_t *psgpio_set_irq)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	if (bit_length > 32) {
		//dbg_printf("hal_sgpio_set_txdata_bit_length_int_rtl8195bhp: bit_cnt > 32 \r\n");
		return HAL_ERR_PARA;
	} else {

		if (bit_length != 0x00) {

			reg_temp = psgpio_reg->SGPIO_MULPOSR;
			reg_temp &= ~(SGPIO_MASK_MULPOSRST);
			reg_temp |= ((bit_length - 1) << SGPIO_SHIFT_MULPOSRST);
			psgpio_reg->SGPIO_MULPOSR = reg_temp;

			reg_temp = psgpio_reg->SGPIO_MULPOSR;
			reg_temp &= ~(SGPIO_MASK_MULPOSTC);
			reg_temp |= ((bit_length - 1) << SGPIO_SHIFT_MULPOSTC);
			psgpio_reg->SGPIO_MULPOSR = reg_temp;

		} else {
			psgpio_reg->SGPIO_MULPOSR &= ~(SGPIO_MASK_MULPOSRST | SGPIO_MASK_MULPOSTC);
		}

