Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	}

	reg_temp = psgpio_reg->SGPIO_IM;
	reg_temp &= ~(SGPIO_BIT_MULLOAD_IM);
	reg_temp |= ((psgpio_set_irq->imr_en) << SGPIO_SHIFT_MULLOAD_IM);
	psgpio_reg->SGPIO_IM = reg_temp;

	reg_temp = psgpio_reg->SGPIO_DATA_CTRL;
	reg_temp &= ~(SGPIO_BIT_MULLOAD_IE);
	reg_temp |= ((psgpio_set_irq->int_en) << SGPIO_SHIFT_MULLOAD_IE);
	psgpio_reg->SGPIO_DATA_CTRL = reg_temp;

	if (psgpio_set_irq->callback_reg_en == 1) {
		hal_rom_sgpio_reg_cb(psgpio_adp, psgpio_set_irq->callback, psgpio_set_irq->arg, Mulload_Sft);
	} else {
		hal_rom_sgpio_unreg_cb(psgpio_adp, Mulload_Sft);
	}

	return HAL_OK;

}

/**
 *  @brief  Control the interrupt when happen the bit shift of txdata.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_set_irq The parameter structure is for initializing the interrupt event.
 *                      int_en - 0: disbale this event interrupt, 1: enable.
 *                      imr_en - 0: disbale mask event interrupt, 1: enable.
 *                      callback_reg_en - 0: don't register this callback function, 1: register this callback function.
 *                      callback - The callback function.
 *                      arg - The callback argument.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_set_txdata_prebuf_bit_shift_int(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_set_irq_t *psgpio_set_irq)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_IM;
	reg_temp &= ~(SGPIO_BIT_MULSFT_IM);
	reg_temp |= (psgpio_set_irq->imr_en << SGPIO_SHIFT_MULSFT_IM);
	psgpio_reg->SGPIO_IM = reg_temp;

	reg_temp = psgpio_reg->SGPIO_DATA_CTRL;
	reg_temp &= ~(SGPIO_BIT_MULSFT_IE);
	reg_temp |= (psgpio_set_irq->int_en << SGPIO_SHIFT_MULSFT_IE);
	psgpio_reg->SGPIO_DATA_CTRL = reg_temp;

	if (psgpio_set_irq->callback_reg_en == 1) {
		hal_rom_sgpio_reg_cb(psgpio_adp, psgpio_set_irq->callback, psgpio_set_irq->arg, Mulsft_Sft);
	} else {
		hal_rom_sgpio_unreg_cb(psgpio_adp, Mulsft_Sft);
	}
}

/**
 *  @brief  Reset the txdata.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_reset_txdata(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	psgpio_reg->SGPIO_MULDATA = 0X00;
	psgpio_reg->SGPIO_MULDATA_DP = 0X00;
}

/**
 *  @brief  Get the rxtc match value of the count unit. Change the unit from time to count.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  time_unit Select the time unit us or ns.
 *  @param[in]  time_value The time value.
 *
 *  @returns The rxtc match value.
 */
SECTION_SGPIO_TEXT
u32 hal_rom_sgpio_set_time_to_rxtc(hal_sgpio_adapter_t *psgpio_adp, sgpio_time_unit_t time_unit, u32 time_value)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 tc_unit, prescale_num;
	u16 old_prescale, new_prescale;
	float ns_unit, ftc_unit, tc_resolution;
	u32 reg_temp;

	old_prescale = ((psgpio_reg->SGPIO_RXPRVAL & SGPIO_MASK_RXPRVAL) >> SGPIO_SHIFT_RXPRVAL);

	prescale_num = (u32)old_prescale;

	ns_unit = (float)time_value;
	if (time_unit == Time_unit_us) {
		ns_unit = ns_unit * 1000;
	}

	while (1) {

		tc_resolution = (float)(prescale_num + 1) * psgpio_adp->sgpio_sclk_ns;

		ftc_unit = ns_unit / tc_resolution;

		tc_unit = (u32)(ftc_unit + 0.5f);

		if (tc_unit > 0xFFFF) {
			prescale_num++;
			if (prescale_num > 0xFFFF) {
				//dbg_printf("hal_sgpio_set_time_to_rxtc_rtl8195bhp: ns_unit is over range \r\n");
				break;
			}

			reg_temp = psgpio_reg->SGPIO_RXPRVAL;
			reg_temp &= ~(SGPIO_MASK_RXPRVAL);
			reg_temp |= (prescale_num << SGPIO_SHIFT_RXPRVAL);
			psgpio_reg->SGPIO_RXPRVAL = reg_temp;

		} else {
			break;
		}

	}

	new_prescale = (u16)prescale_num;

	if (new_prescale != old_prescale) {
		hal_rom_sgpio_update_rxtcmr(psgpio_adp, Rxtc_MatchEvent0, old_prescale);
		hal_rom_sgpio_update_rxtcmr(psgpio_adp, Rxtc_MatchEvent1, old_prescale);
		hal_rom_sgpio_update_rxtcmr(psgpio_adp, Rxtc_MatchEvent2, old_prescale);
	}

	if (tc_unit != 0x00) {
		tc_unit = tc_unit - 1;
	}

	return tc_unit;
}

/**
 *  @brief  Get the multc match value of the count unit. Change the unit from time to count.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  time_unit Select the time unit us or ns.
 *  @param[in]  time_value The time value.
 *
 *  @returns The multc match value.
 */
SECTION_SGPIO_TEXT
u32 hal_rom_sgpio_set_time_to_multc(hal_sgpio_adapter_t *psgpio_adp, sgpio_time_unit_t time_unit, u32 time_value)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 tc_unit, prescale_num;
	u16 old_prescale, new_prescale;
	float ns_unit, ftc_unit, tc_resolution;
	u32 reg_temp;

	old_prescale = ((psgpio_reg->SGPIO_MULPRVAL & SGPIO_MASK_MULPRVAL) >> SGPIO_SHIFT_MULPRVAL);

	prescale_num = (u32)old_prescale;

	ns_unit = (float)time_value;
	if (time_unit == Time_unit_us) {
		ns_unit = ns_unit * 1000;
	}

	while (1) {

		tc_resolution = (float)(prescale_num + 1) * psgpio_adp->sgpio_sclk_ns;

		ftc_unit = ns_unit / tc_resolution;

		tc_unit = (u32)(ftc_unit + 0.5f);

		if (tc_unit > 0xFFFF) {
			prescale_num++;
			if (prescale_num > 0xFFFF) {
				//dbg_printf("hal_sgpio_set_time_to_multc_rtl8195bhp: ns_unit is over range \r\n");
				break;
			}

			reg_temp = psgpio_reg->SGPIO_MULPRVAL;
			reg_temp &= ~(SGPIO_MASK_MULPRVAL);
			reg_temp |= (prescale_num << SGPIO_SHIFT_MULPRVAL);
			psgpio_reg->SGPIO_MULPRVAL = reg_temp;

		} else {
			break;
		}

	}

	new_prescale = (u16)prescale_num;

	if (tc_unit != 0x00) {
		tc_unit = tc_unit - 1;
	}

	if (new_prescale != old_prescale) {

		hal_rom_sgpio_update_multcmr(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent0, old_prescale);
		hal_rom_sgpio_update_multcmr(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent1, old_prescale);
		hal_rom_sgpio_update_multcmr(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent2, old_prescale);
		hal_rom_sgpio_update_multcmr(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent3, old_prescale);
		hal_rom_sgpio_update_multcmr(psgpio_adp, Multc_MatchGroup1, Multc_MatchEvent0, old_prescale);
		hal_rom_sgpio_update_multcmr(psgpio_adp, Multc_MatchGroup1, Multc_MatchEvent1, old_prescale);
		hal_rom_sgpio_update_multcmr(psgpio_adp, Multc_MatchGroup1, Multc_MatchEvent2, old_prescale);
		hal_rom_sgpio_update_multcmr(psgpio_adp, Multc_MatchGroup1, Multc_MatchEvent3, old_prescale);
	}

