Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	return tc_unit;
}

/**
 *  @brief  Get the rxtc match value of the time unit. Change the unit from count to time.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  rxtc_unit The count value.
 *  @param[in]  time_unit Select the time unit us or ns.
 *
 *  @returns The rxtc match value.
 */
SECTION_SGPIO_TEXT
u32 hal_rom_sgpio_set_rxtc_to_time(hal_sgpio_adapter_t *psgpio_adp, u16 rxtc_unit, sgpio_time_unit_t time_unit)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 ns_unit, tc_resolution;
	u32 reg_temp;

	reg_temp = (psgpio_reg->SGPIO_RXPRVAL & SGPIO_MASK_RXPRVAL) >> SGPIO_SHIFT_RXPRVAL;
	tc_resolution = (reg_temp + 1) * (u32)psgpio_adp->sgpio_sclk_ns;

	ns_unit = (u32)rxtc_unit;

	if (ns_unit != 0x00) {
		ns_unit = (ns_unit + 1) * tc_resolution;
	}

	if (time_unit == Time_unit_us) {
		ns_unit = ns_unit / 1000;
	}

	return ns_unit;
}

/**
 *  @brief  Get the multc match value of the time unit. Change the unit from count to time.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  multc_unit The count value.
 *  @param[in]  time_unit Select the time unit us or ns.
 *
 *  @returns The multc match value.
 */
SECTION_SGPIO_TEXT
u32 hal_rom_sgpio_set_multc_to_time(hal_sgpio_adapter_t *psgpio_adp, u16 multc_unit, sgpio_time_unit_t time_unit)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 ns_unit, tc_resolution;
	u32 reg_temp;

	reg_temp = (psgpio_reg->SGPIO_MULPRVAL & SGPIO_MASK_MULPRVAL) >> SGPIO_SHIFT_MULPRVAL;
	tc_resolution = (reg_temp + 1) * (u32)psgpio_adp->sgpio_sclk_ns;

	ns_unit = (u32)multc_unit;

	if (ns_unit != 0x00) {
		ns_unit = (ns_unit + 1) * tc_resolution;
	}

	if (time_unit == Time_unit_us) {
		ns_unit = ns_unit / 1000;
	}

	return ns_unit;
}

/**
 *  @brief  Clean the SGPIO interrupt status.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  sgpio_is The interrupt event.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_clean_status(hal_sgpio_adapter_t *psgpio_adp, u32 sgpio_is)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	psgpio_reg->SGPIO_IS = sgpio_is;
}

/**
 *  @brief  Upate the rxtc match value because the prescaler value is changed.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_event Select the rxtc match event.
 *  @param[in]  old_prescale The old prescaler value.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_update_rxtcmr(hal_sgpio_adapter_t *psgpio_adp, sgpio_rxtc_match_event_t match_event, u16 old_prescale)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 rxprval, rxmr_new;
	float frxmr_new;
	u32 rxmr = 0;
	u32 reg_temp;

	reg_temp = (psgpio_reg->SGPIO_RXPRVAL & SGPIO_MASK_RXPRVAL) >> SGPIO_SHIFT_RXPRVAL;
	rxprval = reg_temp + 1;

	if (match_event == Rxtc_MatchEvent0) {
		rxmr = ((psgpio_reg->SGPIO_RXMR0 & SGPIO_MASK_RXMR0) >> SGPIO_SHIFT_RXMR0) + 1;
	} else if (match_event == Rxtc_MatchEvent1) {
		rxmr = ((psgpio_reg->SGPIO_RXMR1 & SGPIO_MASK_RXMR1) >> SGPIO_SHIFT_RXMR1) + 1;
	} else if (match_event == Rxtc_MatchEvent2) {
		rxmr = ((psgpio_reg->SGPIO_RXMR2 & SGPIO_MASK_RXMR2) >> SGPIO_SHIFT_RXMR2) + 1;
	}

	frxmr_new = (float)(rxmr * (u32)(old_prescale + 1)) / (float)(rxprval);
	rxmr_new = (u32)(frxmr_new + 0.5f);

	if (rxmr_new == 0x00) {
		rxmr_new = 1;
	}

	if (match_event == Rxtc_MatchEvent0) {
		reg_temp = psgpio_reg->SGPIO_RXMR0;
		reg_temp &= ~(SGPIO_MASK_RXMR0);
		reg_temp |= (((u16)rxmr_new - 1) << SGPIO_SHIFT_RXMR0);
		psgpio_reg->SGPIO_RXMR0 = reg_temp;
	} else if (match_event == Rxtc_MatchEvent1) {
		reg_temp = psgpio_reg->SGPIO_RXMR1;
		reg_temp &= ~(SGPIO_MASK_RXMR1);
		reg_temp |= (((u16)rxmr_new - 1) << SGPIO_SHIFT_RXMR1);
		psgpio_reg->SGPIO_RXMR1 = reg_temp;
	} else if (match_event == Rxtc_MatchEvent2) {
		reg_temp = psgpio_reg->SGPIO_RXMR2;
		reg_temp &= ~(SGPIO_MASK_RXMR2);
		reg_temp |= (((u16)rxmr_new - 1) << SGPIO_SHIFT_RXMR2);
		psgpio_reg->SGPIO_RXMR2 = reg_temp;
	}

}

/**
 *  @brief  Upate the multc match value because the prescaler value is changed.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  match_group Select the multc match group.
 *  @param[in]  match_event Select the multc match event.
 *  @param[in]  old_prescale The old prescaler value.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_update_multcmr(hal_sgpio_adapter_t *psgpio_adp, sgpio_multc_match_group_t match_group, sgpio_multc_match_event_t match_event,
								  u16 old_prescale)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 mulprval, mulmr_new;
	float fmulmr_new;
	u32 mulmr = 0;
	u32 reg_temp;

	reg_temp = (psgpio_reg->SGPIO_MULPRVAL & SGPIO_MASK_MULPRVAL) >> SGPIO_SHIFT_MULPRVAL;
	mulprval = reg_temp + 1;

	if (match_group == Multc_MatchGroup0) {
		if (match_event == Multc_MatchEvent0) {
			mulmr = ((psgpio_reg->SGPIO_MULMR01GP0 & SGPIO_MASK_MULMR0_GP0) >> SGPIO_SHIFT_MULMR0_GP0) + 1;
		} else if (match_event == Multc_MatchEvent1) {
			mulmr = ((psgpio_reg->SGPIO_MULMR01GP0 & SGPIO_MASK_MULMR1_GP0) >> SGPIO_SHIFT_MULMR1_GP0) + 1;
		} else if (match_event == Multc_MatchEvent2) {
			mulmr = ((psgpio_reg->SGPIO_MULMR23GP0 & SGPIO_MASK_MULMR2_GP0) >> SGPIO_SHIFT_MULMR2_GP0) + 1;
		} else if (match_event == Multc_MatchEvent3) {
			mulmr = ((psgpio_reg->SGPIO_MULMR23GP0 & SGPIO_MASK_MULMR3_GP0) >> SGPIO_SHIFT_MULMR3_GP0) + 1;
		}
	} else {
		if (match_event == Multc_MatchEvent0) {
			mulmr = ((psgpio_reg->SGPIO_MULMR01GP1 & SGPIO_MASK_MULMR0_GP1) >> SGPIO_SHIFT_MULMR0_GP1) + 1;
		} else if (match_event == Multc_MatchEvent1) {
			mulmr = ((psgpio_reg->SGPIO_MULMR01GP1 & SGPIO_MASK_MULMR1_GP1) >> SGPIO_SHIFT_MULMR1_GP1) + 1;
		} else if (match_event == Multc_MatchEvent2) {
			mulmr = ((psgpio_reg->SGPIO_MULMR23GP1 & SGPIO_MASK_MULMR2_GP1) >> SGPIO_SHIFT_MULMR2_GP1) + 1;
		} else if (match_event == Multc_MatchEvent3) {
			mulmr = ((psgpio_reg->SGPIO_MULMR23GP1 & SGPIO_MASK_MULMR3_GP1) >> SGPIO_SHIFT_MULMR3_GP1) + 1;
		}
	}

