Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	fmulmr_new = (float)(mulmr * (u32)(old_prescale + 1)) / (float)(mulprval);
	mulmr_new = (u32)(fmulmr_new + 0.5f);

	if (mulmr_new == 0x00) {
		mulmr_new = 1;
	}

	if (match_group == Multc_MatchGroup0) {
		if (match_event == Multc_MatchEvent0) {
			reg_temp = psgpio_reg->SGPIO_MULMR01GP0;
			reg_temp &= ~(SGPIO_MASK_MULMR0_GP0);
			reg_temp |= (((u16)mulmr_new - 1) << SGPIO_SHIFT_MULMR0_GP0);
			psgpio_reg->SGPIO_MULMR01GP0 = reg_temp;
		} else if (match_event == Multc_MatchEvent1) {
			reg_temp = psgpio_reg->SGPIO_MULMR01GP0;
			reg_temp &= ~(SGPIO_MASK_MULMR1_GP0);
			reg_temp |= (((u16)mulmr_new - 1) << SGPIO_SHIFT_MULMR1_GP0);
			psgpio_reg->SGPIO_MULMR01GP0 = reg_temp;
		} else if (match_event == Multc_MatchEvent2) {
			reg_temp = psgpio_reg->SGPIO_MULMR23GP0;
			reg_temp &= ~(SGPIO_MASK_MULMR2_GP0);
			reg_temp |= (((u16)mulmr_new - 1) << SGPIO_SHIFT_MULMR2_GP0);
			psgpio_reg->SGPIO_MULMR23GP0 = reg_temp;
		} else if (match_event == Multc_MatchEvent3) {
			reg_temp = psgpio_reg->SGPIO_MULMR23GP0;
			reg_temp &= ~(SGPIO_MASK_MULMR3_GP0);
			reg_temp |= (((u16)mulmr_new - 1) << SGPIO_SHIFT_MULMR3_GP0);
			psgpio_reg->SGPIO_MULMR23GP0 = reg_temp;
		}
	} else {
		if (match_event == Multc_MatchEvent0) {
			reg_temp = psgpio_reg->SGPIO_MULMR01GP1;
			reg_temp &= ~(SGPIO_MASK_MULMR0_GP1);
			reg_temp |= (((u16)mulmr_new - 1) << SGPIO_SHIFT_MULMR0_GP1);
			psgpio_reg->SGPIO_MULMR01GP1 = reg_temp;
		} else if (match_event == Multc_MatchEvent1) {
			reg_temp = psgpio_reg->SGPIO_MULMR01GP1;
			reg_temp &= ~(SGPIO_MASK_MULMR1_GP1);
			reg_temp |= (((u16)mulmr_new - 1) << SGPIO_SHIFT_MULMR1_GP1);
			psgpio_reg->SGPIO_MULMR01GP1 = reg_temp;
		} else if (match_event == Multc_MatchEvent2) {
			reg_temp = psgpio_reg->SGPIO_MULMR23GP1;
			reg_temp &= ~(SGPIO_MASK_MULMR2_GP1);
			reg_temp |= (((u16)mulmr_new - 1) << SGPIO_SHIFT_MULMR2_GP1);
			psgpio_reg->SGPIO_MULMR23GP1 = reg_temp;
		} else if (match_event == Multc_MatchEvent3) {
			reg_temp = psgpio_reg->SGPIO_MULMR23GP1;
			reg_temp &= ~(SGPIO_MASK_MULMR3_GP1);
			reg_temp |= (((u16)mulmr_new - 1) << SGPIO_SHIFT_MULMR3_GP1);
			psgpio_reg->SGPIO_MULMR23GP1 = reg_temp;
		}
	}

}


//====== Normal Function======

/**
 *  @brief Configure SGPIO to become the rxtc timer.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_rxtc_timer_mode The parameter structure is for initializing the rxtc timer mode.
 *                      timer_once_en - Enable that matching event is executed once.
 *                      time_unit - Select the time unit.
 *                      match_time1 - Matching this time 1 generates the interrupt.
 *                      match_time1_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      pmatch_time1_arg - User defined IRQ callback parameter.
 *                      match_time2 - Matching this time 2 generates the interrupt.
 *                      match_time2_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      pmatch_time2_arg - User defined IRQ callback parameter.
 *                      match_time_reset - This match time is able to make the timer reset and stop.
 *                      time_reset_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      ptime_reset_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_rxtc_timer_mode(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_timer_mode_t *psgpio_rxtc_timer_mode)
{
	hal_sgpio_rxtc_event_t sgpio_rxtc_event, sgpio_rxtc_event_stop;
	hal_sgpio_set_irq_t sgpio_set_irq;
	u16 cnt_tp;
	sgpio_time_unit_t time_unit;

	time_unit = psgpio_rxtc_timer_mode->time_unit;

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_rxtc(psgpio_adp, time_unit, psgpio_rxtc_timer_mode->match_value1_time);
	hal_rom_sgpio_set_rxtc_match_value(psgpio_adp, Rxtc_MatchEvent1, cnt_tp);

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_rxtc(psgpio_adp, time_unit, psgpio_rxtc_timer_mode->match_value2_time);
	hal_rom_sgpio_set_rxtc_match_value(psgpio_adp, Rxtc_MatchEvent2, cnt_tp);

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_rxtc(psgpio_adp, time_unit, psgpio_rxtc_timer_mode->match_reset_value_time);
	hal_rom_sgpio_set_rxtc_match_value(psgpio_adp, Rxtc_MatchEvent0, cnt_tp);

	hal_rom_sgpio_get_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);
	sgpio_rxtc_event.rxtc_match_event0 = 1;
	hal_rom_sgpio_set_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);

	hal_rom_sgpio_get_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);
	sgpio_rxtc_event_stop.rxtc_match_event0 = psgpio_rxtc_timer_mode->timer_once_en;
	hal_rom_sgpio_set_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);

	sgpio_set_irq.imr_en = 0;
	if (psgpio_rxtc_timer_mode->match_value1_cb != NULL) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_rxtc_timer_mode->match_value1_cb;
		sgpio_set_irq.arg = psgpio_rxtc_timer_mode->pmatch_value1_arg;
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
	}
	hal_rom_sgpio_set_rxtc_int(psgpio_adp, Rxtc_MatchEvent1, &sgpio_set_irq);

	if (psgpio_rxtc_timer_mode->match_value2_cb != NULL) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_rxtc_timer_mode->match_value2_cb;
		sgpio_set_irq.arg = psgpio_rxtc_timer_mode->pmatch_value2_arg;
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
	}
	hal_rom_sgpio_set_rxtc_int(psgpio_adp, Rxtc_MatchEvent2, &sgpio_set_irq);

	if (psgpio_rxtc_timer_mode->reset_value_cb != NULL) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_rxtc_timer_mode->reset_value_cb;
		sgpio_set_irq.arg = psgpio_rxtc_timer_mode->preset_value_arg;
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
	}
	hal_rom_sgpio_set_rxtc_int(psgpio_adp, Rxtc_MatchEvent0, &sgpio_set_irq);

