Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
}

/**
 *  @brief Configure SGPIO to become the multc timer.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_multc_timer_mode The parameter structure is for initializing the multc timer mode.
 *                      timer_once_en - Enable that matching event is executed once.
 *                      time_unit - Select the time unit.
 *                      match_time_reset - This match time is able to make the timer reset and stop.
 *                      time_reset_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      ptime_reset_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_multc_timer_mode(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_timer_mode_t *psgpio_multc_timer_mode)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	hal_sgpio_multc_event_t sgpio_multc_event, sgpio_multc_event_stop;
	hal_sgpio_set_irq_t sgpio_set_irq;
	u16 cnt_tp;
	sgpio_time_unit_t time_unit;

	time_unit = psgpio_multc_timer_mode->time_unit;

	psgpio_reg->SGPIO_MULDATA = psgpio_reg->SGPIO_MULDATA & 0xFFFFFFFE;
	cnt_tp = (u16)hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, psgpio_multc_timer_mode->match_reset_value_time);
	hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent0, cnt_tp);

	hal_rom_sgpio_get_multc_reset_ctrl(psgpio_adp, &sgpio_multc_event);
	sgpio_multc_event.multc_match_event0 = 1;
	hal_rom_sgpio_set_multc_reset_ctrl(psgpio_adp, &sgpio_multc_event);

	hal_rom_sgpio_get_multc_stop_ctrl(psgpio_adp, &sgpio_multc_event_stop);
	sgpio_multc_event_stop.multc_match_event0 = psgpio_multc_timer_mode->timer_once_en;
	hal_rom_sgpio_set_multc_stop_ctrl(psgpio_adp, &sgpio_multc_event_stop);

	sgpio_set_irq.imr_en = 0;
	if (psgpio_multc_timer_mode->reset_value_cb != NULL) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_multc_timer_mode->reset_value_cb;
		sgpio_set_irq.arg = psgpio_multc_timer_mode->preset_value_arg;
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
	}
	hal_rom_sgpio_set_multc_match_event0_int(psgpio_adp, &sgpio_set_irq);

}

/**
 *  @brief Configure SGPIO to count input triggers.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_multc_counter_mode The parameter structure is for initializing the multc counter mode.
 *                      counter_en - To enable or disable.
 *                      input_edge - Select the edge of the trigger event.
 *                      match_value - When the counter value is equal to match_value, generate an interrupt.
 *                      match_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      pmatch_arg - User defined IRQ callback parameter.
 *                      match_reset_en - When the counter value is equal to match_value, reset the counter.
 *                      match_disable_en - When the counter value is equal to match_value, make counter_en become disable(0).
 *                      timeout_unit -Select the time unit.
 *                      counter_reset_timeout -Set the monitor period.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_multc_counter_mode(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_counter_mode_t *psgpio_multc_counter_mode)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	hal_sgpio_multc_event_t sgpio_multc_event, sgpio_multc_event_stop;
	hal_sgpio_rxtc_event_t sgpio_rxtc_event, sgpio_rxtc_event_stop;
	hal_sgpio_set_irq_t sgpio_set_irq;
	u16 cnt_tp;
	sgpio_time_unit_t time_unit;
	u32 reg_temp;

	time_unit = psgpio_multc_counter_mode->time_unit;

	reg_temp = psgpio_reg->SGPIO_MULTMR_CTRL;
	reg_temp &= ~(SGPIO_MASK_MULMODE_EN);
	reg_temp |= (psgpio_multc_counter_mode->input_edge << SGPIO_SHIFT_MULMODE_EN);
	psgpio_reg->SGPIO_MULTMR_CTRL = reg_temp;

	psgpio_reg->SGPIO_MULDATA = psgpio_reg->SGPIO_MULDATA & 0xFFFFFFFE;

	hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent0, psgpio_multc_counter_mode->match_counter_value);

	hal_rom_sgpio_get_multc_reset_ctrl(psgpio_adp, &sgpio_multc_event);
	sgpio_multc_event.multc_match_event0 = psgpio_multc_counter_mode->match_counter_reset_en;
	sgpio_multc_event.rxtc_match_event0 = 1;
	hal_rom_sgpio_set_multc_reset_ctrl(psgpio_adp, &sgpio_multc_event);

	hal_rom_sgpio_get_multc_stop_ctrl(psgpio_adp, &sgpio_multc_event_stop);
	sgpio_multc_event_stop.multc_match_event0 = psgpio_multc_counter_mode->match_counter_disable_en;
	hal_rom_sgpio_set_multc_stop_ctrl(psgpio_adp, &sgpio_multc_event_stop);

	if (psgpio_multc_counter_mode->counter_reset_timeout_value != 0x00) {
		reg_temp = psgpio_reg->SGPIO_RXTMR_CTRL;
		reg_temp &= ~(SGPIO_MASK_RXTMREDGE_SEL);
		reg_temp |= (psgpio_multc_counter_mode->input_edge << SGPIO_SHIFT_RXTMREDGE_SEL);
		psgpio_reg->SGPIO_RXTMR_CTRL = reg_temp;

		cnt_tp = (u16)hal_rom_sgpio_set_time_to_rxtc(psgpio_adp, time_unit, psgpio_multc_counter_mode->counter_reset_timeout_value);
		hal_rom_sgpio_set_rxtc_match_value(psgpio_adp, Rxtc_MatchEvent0, cnt_tp);

		hal_rom_sgpio_get_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);
		sgpio_rxtc_event.rxtc_match_event0 = 1;
		sgpio_rxtc_event.multc_match_event0 = 1;
		hal_rom_sgpio_set_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);

		hal_rom_sgpio_get_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);
		sgpio_rxtc_event_stop.rxtc_match_event0 = 1;
		sgpio_rxtc_event_stop.multc_match_event0 = 1;
		hal_rom_sgpio_set_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);
	} else {
		reg_temp = psgpio_reg->SGPIO_RXTMR_CTRL;
		reg_temp &= ~(SGPIO_MASK_RXTMREDGE_SEL);
		psgpio_reg->SGPIO_RXTMR_CTRL = reg_temp;
	}

	sgpio_set_irq.imr_en = 0;
	if (psgpio_multc_counter_mode->match_counter_cb != NULL) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_multc_counter_mode->match_counter_cb;
		sgpio_set_irq.arg = psgpio_multc_counter_mode->pmatch_counter_arg;
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
	}
	hal_rom_sgpio_set_multc_match_event0_int(psgpio_adp, &sgpio_set_irq);

	reg_temp = (psgpio_reg->SGPIO_MULTMR_CTRL & SGPIO_MASK_MULMODE_EN) >> SGPIO_SHIFT_MULMODE_EN;

	if (reg_temp != 0x00) {
		reg_temp = psgpio_reg->SGPIO_MULTMR_CTRL;
		reg_temp &= ~(SGPIO_BIT_MULTMR_CEN);
		reg_temp |= (psgpio_multc_counter_mode->counter_en << SGPIO_SHIFT_MULTMR_CEN);
		psgpio_reg->SGPIO_MULTMR_CTRL = reg_temp;
	} else {
		reg_temp = psgpio_reg->SGPIO_MULTMR_CTRL;
		reg_temp &= ~(SGPIO_BIT_MULTMR_CEN);
		psgpio_reg->SGPIO_MULTMR_CTRL = reg_temp;
	}

