Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
}

/**
 *  @brief Generate the external output when happen the match events of the rxtc timer.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_rxtc_timer_match_output The parameter structure is for initializing the rxtc timer match output.
 *                      match_time1_output - Set the output value when match the time 1.
 *                      match_time2_output - Set the output value when match the time 2.
 *                      match_reset_time_output - Set the output value when match the reset time.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_rxtc_timer_match_output(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_timer_match_output_t *psgpio_rxtc_timer_match_output)
{
	hal_rom_sgpio_set_rxtc_external_match(psgpio_adp, Rxtc_MatchEvent1, psgpio_rxtc_timer_match_output->match_value1_output);
	hal_rom_sgpio_set_rxtc_external_match(psgpio_adp, Rxtc_MatchEvent2, psgpio_rxtc_timer_match_output->match_value2_output);
	hal_rom_sgpio_set_rxtc_external_match(psgpio_adp, Rxtc_MatchEvent0, psgpio_rxtc_timer_match_output->match_reset_value_output);
}

/**
 *  @brief Generate the external output when happen the match events of the multc timer counter.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_multc_timer_counter_match_output The parameter structure is for initializing the multc timer match output.
 *                      source_unit - Select the time unit.
 *                      match_value1_output - Set the output value when happen the multc match event 1.
 *                      match_value1 - The match value 1 of the multc timer counter.
 *                      match_value2_output - Set the output value when happen the multc match event 2.
 *                      match_value2 - The match value 2 of the multc timer counter.
 *                      match_value3_output - Set the output value when happen the multc match event 3.
 *                      match_value3 - The match value 3 of the multc timer counter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_multc_timer_counter_match_output(hal_sgpio_adapter_t *psgpio_adp,
		hal_sgpio_multc_timer_counter_match_output_t *psgpio_multc_timer_counter_match_output)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u16 cnt_tp;
	sgpio_time_unit_t time_unit;

	psgpio_reg->SGPIO_MULDATA = psgpio_reg->SGPIO_MULDATA & 0xFFFFFFFE;

	if (psgpio_multc_timer_counter_match_output->source_unit != Countr_mode_unit_cnt) {

		time_unit = psgpio_multc_timer_counter_match_output->source_unit;

		cnt_tp = (u16)hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, psgpio_multc_timer_counter_match_output->match_value1);
		hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent1, cnt_tp);

		cnt_tp = (u16)hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, psgpio_multc_timer_counter_match_output->match_value2);
		hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent2, cnt_tp);

		cnt_tp = (u16)hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, psgpio_multc_timer_counter_match_output->match_value3);
		hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent3, cnt_tp);

	} else {
		hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent1, psgpio_multc_timer_counter_match_output->match_value1);
		hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent2, psgpio_multc_timer_counter_match_output->match_value2);
		hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent3, psgpio_multc_timer_counter_match_output->match_value3);
	}

	hal_rom_sgpio_set_multc_external_match(psgpio_adp, Multc_MatchEvent1, psgpio_multc_timer_counter_match_output->match_value1_output);
	hal_rom_sgpio_set_multc_external_match(psgpio_adp, Multc_MatchEvent2, psgpio_multc_timer_counter_match_output->match_value2_output);
	hal_rom_sgpio_set_multc_external_match(psgpio_adp, Multc_MatchEvent3, psgpio_multc_timer_counter_match_output->match_value3_output);
}

/**
 *  @brief Configure SGPIO to become the capture mode for measuring the pulse width.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_rxtc_capture_mode The parameter structure is for initializing the rxtc capture mode.
 *                      capture_en - To enable or disable.
 *                      start_timer_edge - Select the trigger edge for starting the rxtc timer.
 *                      input_capture_edge - Select the capture edge for capturing the time.
 *                      capture_timer_reset_en - When happen the capture event, reset the rxtc timer.
 *                      capture_timer_disable_en - When happen the capture event, stop the rxtc timer.
 *                      max_capture_range_us - Set the maximum possible measurement value for making the prescale of the timer automatically.
 *                      capture_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      pcapture_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_rxtc_capture_mode(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_capture_mode_t *psgpio_rxtc_capture_mode)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	hal_sgpio_rxtc_event_t sgpio_rxtc_event, sgpio_rxtc_event_stop;
	hal_sgpio_set_irq_t sgpio_set_irq;
	float max_capture_range_us, timer_max_us;
	u32 prescale32_tp;
	u32 reg_temp;

	if (psgpio_rxtc_capture_mode->max_capture_range_us != 0x00) {
		timer_max_us = 0xFFFF * psgpio_adp->sgpio_sclk_ns / 1000;
		max_capture_range_us = (float)psgpio_rxtc_capture_mode->max_capture_range_us;
		prescale32_tp = (u32)(max_capture_range_us / timer_max_us);

		if ((prescale32_tp & 0xffff0000) == 0x00) {
			reg_temp = psgpio_reg->SGPIO_RXPRVAL;
			reg_temp &= ~(SGPIO_MASK_RXPRVAL);
			reg_temp |= (((u16)prescale32_tp) << SGPIO_SHIFT_RXPRVAL);
			psgpio_reg->SGPIO_RXPRVAL = reg_temp;
		} else {
			reg_temp = psgpio_reg->SGPIO_RXPRVAL;
			reg_temp &= ~(SGPIO_MASK_RXPRVAL);
			psgpio_reg->SGPIO_RXPRVAL = reg_temp;
			//dbg_printf("hal_sgpio_rxtc_capture_mode_rtl8195bhp: max_capture_range_us is over range \r\n");
		}

	} else {
		reg_temp = psgpio_reg->SGPIO_RXPRVAL;
		reg_temp &= ~(SGPIO_MASK_RXPRVAL);
		psgpio_reg->SGPIO_RXPRVAL = reg_temp;
	}

	reg_temp = psgpio_reg->SGPIO_RXTMR_CTRL;
	reg_temp &= ~(SGPIO_MASK_RXTMREDGE_SEL);
	reg_temp |= (psgpio_rxtc_capture_mode->start_timer_edge << SGPIO_SHIFT_RXTMREDGE_SEL);
	psgpio_reg->SGPIO_RXTMR_CTRL = reg_temp;

	hal_rom_sgpio_set_capture_ctrl(psgpio_adp, psgpio_rxtc_capture_mode->input_capture_edge, psgpio_rxtc_capture_mode->capture_en);

