Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	hal_rom_sgpio_get_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);
	sgpio_rxtc_event.capture_event = psgpio_rxtc_capture_mode->capture_timer_reset_en;
	hal_rom_sgpio_set_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);

	hal_rom_sgpio_get_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);
	sgpio_rxtc_event_stop.capture_event = psgpio_rxtc_capture_mode->capture_timer_disable_en;
	hal_rom_sgpio_set_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);

	sgpio_set_irq.imr_en = 0;
	if (psgpio_rxtc_capture_mode->capture_cb != NULL) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_rxtc_capture_mode->capture_cb;
		sgpio_set_irq.arg = psgpio_rxtc_capture_mode->pcapture_arg;
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
	}
	hal_rom_sgpio_set_capture_int(psgpio_adp, &sgpio_set_irq);

}

/**
 *  @brief Make the capture timer reset and stop in the capture mode when the timer value is equal to timeout_value.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_rxtc_capture_mode The parameter structure is for initializing the rxtc capture timeout.
 *                      capture_timeout_en - To enable or disable.
 *                      capture_timer_reset_en - Reset the capture timer when the timer value is equal to timeout_value.
 *                      capture_timer_disable_en - Stop the capture timer when the timer value is equal to timeout_value.
 *                      time_unit - Select the time unit.
 *                      timeout_value - Matching this timeout value generates the interrupt.
 *                      capture_timeout_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      pcapture_timeout_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_rxtc_capture_timeout(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_capture_timeout_t *psgpio_rxtc_capture_timeout)
{
	hal_sgpio_rxtc_event_t sgpio_rxtc_event, sgpio_rxtc_event_stop;
	hal_sgpio_set_irq_t sgpio_set_irq;
	u16 cnt_tp;
	sgpio_time_unit_t time_unit;

	time_unit = psgpio_rxtc_capture_timeout->time_unit;

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_rxtc(psgpio_adp, time_unit, psgpio_rxtc_capture_timeout->timeout_value);
	hal_rom_sgpio_set_rxtc_match_value(psgpio_adp, Rxtc_MatchEvent2, cnt_tp);

	hal_rom_sgpio_get_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);
	hal_rom_sgpio_get_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);

	if (psgpio_rxtc_capture_timeout->capture_timeout_en != 0x00) {
		sgpio_rxtc_event.rxtc_match_event2 = psgpio_rxtc_capture_timeout->capture_timer_reset_en;
		sgpio_rxtc_event_stop.rxtc_match_event2 = psgpio_rxtc_capture_timeout->capture_timer_disable_en;
	} else {
		sgpio_rxtc_event.rxtc_match_event2 = 0;
		sgpio_rxtc_event_stop.rxtc_match_event2 = 0;
	}

	hal_rom_sgpio_set_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);
	hal_rom_sgpio_set_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);

	sgpio_set_irq.imr_en = 0;
	if ((psgpio_rxtc_capture_timeout->capture_timeout_en != 0x00) && (psgpio_rxtc_capture_timeout->capture_timeout_cb != NULL)) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_rxtc_capture_timeout->capture_timeout_cb;
		sgpio_set_irq.arg = psgpio_rxtc_capture_timeout->pcapture_timeout_arg;
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
	}
	hal_rom_sgpio_set_rxtc_int(psgpio_adp, Rxtc_MatchEvent2, &sgpio_set_irq);

}

/**
 *  @brief Monitor the capture value. When the capture value is bigger than monitor time, generate the interrupt.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_rxtc_capture_monitor The parameter structure is for initializing the rxtc capture monitor.
 *                      capture_monitor_en - To enable or disable.
 *                      time_unit - Select the time unit.
 *                      monitor_time - The monitor value.
 *                      monitor_count - Set the continuous numbers of the successful condition. Value: 1 ~ 32, 0: do nothing.
 *                      capture_monitor_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      pcapture_monitor_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_rxtc_capture_monitor(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_capture_monitor_t *psgpio_rxtc_capture_monitor)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	hal_sgpio_set_irq_t sgpio_set_irq;
	u32 data_mask;

	data_mask = 0xffffffff;
	if ((psgpio_rxtc_capture_monitor->monitor_count != 0x00) && (psgpio_rxtc_capture_monitor->monitor_count < 33)) {

		if (psgpio_rxtc_capture_monitor->monitor_count != 32) {
			data_mask = ~(data_mask >> (psgpio_rxtc_capture_monitor->monitor_count));
		} else {
			data_mask = 0xffffffff;
		}
	}

	if (psgpio_rxtc_capture_monitor->monitor_count > 32) {
		//dbg_printf("hal_sgpio_rxtc_capture_monitor_rtl8195bhp: monitor_count is bigger than 32 \r\n");
	}

	sgpio_set_irq.imr_en = 0;
	if ((psgpio_rxtc_capture_monitor->capture_monitor_en != 0x00) && (psgpio_rxtc_capture_monitor->capture_monitor_cb != NULL)) {
		hal_rom_sgpio_init_rxdata_capture_compare_time(psgpio_adp, 1, psgpio_rxtc_capture_monitor->time_unit, psgpio_rxtc_capture_monitor->monitor_time);
		hal_rom_sgpio_set_rxdata_direction(psgpio_adp, 0);

		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_rxtc_capture_monitor->capture_monitor_cb;
		sgpio_set_irq.arg = psgpio_rxtc_capture_monitor->pcapture_monitor_arg;
		hal_rom_sgpio_set_rxdata_match_int(psgpio_adp, 1, data_mask, &sgpio_set_irq);

		psgpio_reg->SGPIO_RXDATAMASK = data_mask;
	} else {
		hal_rom_sgpio_deinit_rxdata_capture_compare(psgpio_adp);

		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
		hal_rom_sgpio_set_rxdata_match_int(psgpio_adp, 0, 0, &sgpio_set_irq);
		hal_rom_sgpio_reset_rxdata(psgpio_adp);
	}

