Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
}

/**
 *  @brief Get the capture value.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  time_unit Select the time unit.
 *
 *  @returns The capture value.
 */
SECTION_SGPIO_TEXT
u32 hal_rom_sgpio_get_rxtc_capture_time(hal_sgpio_adapter_t *psgpio_adp, sgpio_time_unit_t time_unit)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u16 capr;
	u32 cap_us;

	capr = (psgpio_reg->SGPIO_CAPR & SGPIO_MASK_CAPR) >> SGPIO_SHIFT_CAPR;
	cap_us = hal_rom_sgpio_set_rxtc_to_time(psgpio_adp, capr, time_unit);

	return cap_us;
}

/**
 *  @brief  Initialize that the rxdata source is the capture compare result.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  cmp_result_bit Set that the rxdata register receives value 0 or 1 when the capture value is bigger than cap_cmpval.
 *  @param[in]  time_unit Select the time unit.
 *  @param[in]  cap_cmpval_time The compare value. This unit is time.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_init_rxdata_capture_compare_time(hal_sgpio_adapter_t *psgpio_adp, sgpio_cmp_result_bit_t cmp_result_bit, sgpio_time_unit_t time_unit,
		u32 cap_cmpval_time)
{
	u16 cnt_tp;

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_rxtc(psgpio_adp, time_unit, cap_cmpval_time);
	hal_rom_sgpio_init_rxdata_capture_compare(psgpio_adp, cmp_result_bit, cnt_tp);
}

/**
 *  @brief Set the trigger edge to start the timer, and sample the input value according to the sampling time.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_sampling_data The parameter structure is for initializing the sampling rxdata.
 *                      sampling_en - To enable or disable.
 *                      start_timer_edge - Select the trigger edge for starting the rxtc timer.
 *                      time_unit - Select the time unit.
 *                      sampling_time1 - The sampling time 1 needs less than the sampling end time. Set to 0 when not in use.
 *                      sampling_time2 - The sampling time 2 needs less than the sampling end time. Set to 0 when not in use.
 *                      sampling_end_time - The sampling end time. Matching this time is to make the timer reset and stop.
 *                      sampling_bit_length - Set the bit length generated the interrupt. Value: 1 ~ 32, 0: do nothing.
 *                      first_msb_or_lsb - Putting in the register is LSB or MSB.
 *                      sampling_finish_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      psampling_finish_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_sampling_rxdata(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_sampling_rxdata_t *psgpio_sampling_data)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	hal_sgpio_rxtc_event_t sgpio_rxtc_event, sgpio_rxtc_event_stop;
	hal_sgpio_set_irq_t sgpio_set_irq;
	hal_sgpio_sampling_event_t sgpio_sampling_event;

	u16 cnt_tp;
	sgpio_time_unit_t time_unit;
	u32 reg_temp;

	time_unit = psgpio_sampling_data->time_unit;

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_rxtc(psgpio_adp, time_unit, psgpio_sampling_data->sampling_time1_time);
	hal_rom_sgpio_set_rxtc_match_value(psgpio_adp, Rxtc_MatchEvent1, cnt_tp);

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_rxtc(psgpio_adp, time_unit, psgpio_sampling_data->sampling_time2_time);
	hal_rom_sgpio_set_rxtc_match_value(psgpio_adp, Rxtc_MatchEvent2, cnt_tp);

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_rxtc(psgpio_adp, time_unit, psgpio_sampling_data->sampling_time_end_time);
	hal_rom_sgpio_set_rxtc_match_value(psgpio_adp, Rxtc_MatchEvent0, cnt_tp);

	hal_rom_sgpio_get_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);
	sgpio_rxtc_event.rxtc_match_event0 = 1;
	hal_rom_sgpio_set_rxtc_reset_ctrl(psgpio_adp, &sgpio_rxtc_event);

	hal_rom_sgpio_get_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);
	sgpio_rxtc_event_stop.rxtc_match_event0 = 1;
	hal_rom_sgpio_set_rxtc_stop_ctrl(psgpio_adp, &sgpio_rxtc_event_stop);

	hal_rom_sgpio_set_rxdata_direction(psgpio_adp, psgpio_sampling_data->first_msb_or_lsb);
	psgpio_adp->sgpio_rx_info.first_data_flag = psgpio_sampling_data->first_msb_or_lsb;

	if (psgpio_sampling_data->sampling_en != 0x00) {

		if (psgpio_sampling_data->sampling_time1_time != 0x00) {
			sgpio_sampling_event.rxtc_match_event1 = 1;
		} else {
			sgpio_sampling_event.rxtc_match_event1 = 0;
		}
		if (psgpio_sampling_data->sampling_time2_time != 0x00) {
			sgpio_sampling_event.rxtc_match_event2 = 1;
		} else {
			sgpio_sampling_event.rxtc_match_event2 = 0;
		}
		if (psgpio_sampling_data->sampling_time_end_time != 0x00) {
			sgpio_sampling_event.rxtc_match_event0 = 1;
		} else {
			sgpio_sampling_event.rxtc_match_event0 = 0;
		}
		hal_rom_sgpio_init_rxdata_time_sampling(psgpio_adp, &sgpio_sampling_event);

	} else {
		hal_rom_sgpio_deinit_rxdata_time_sampling(psgpio_adp);
	}

	sgpio_set_irq.imr_en = 0;
	if (psgpio_sampling_data->sampling_finish_cb != NULL) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_sampling_data->sampling_finish_cb;
		sgpio_set_irq.arg = psgpio_sampling_data->psampling_finish_arg;
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
	}
	hal_rom_sgpio_set_rxdata_load_int(psgpio_adp, psgpio_sampling_data->sampling_bit_length, &sgpio_set_irq);

	reg_temp = psgpio_reg->SGPIO_RXTMR_CTRL;
	reg_temp &= ~(SGPIO_MASK_RXTMREDGE_SEL);
	reg_temp |= (psgpio_sampling_data->start_timer_edge << SGPIO_SHIFT_RXTMREDGE_SEL);
	psgpio_reg->SGPIO_RXTMR_CTRL = reg_temp;

	psgpio_adp->sgpio_rx_info.rx_bit_length_copy = psgpio_sampling_data->sampling_bit_length;

}

/**
 *  @brief Get the register of the rxdata by sample or capture.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns The result register.
 */
SECTION_SGPIO_TEXT
u32 hal_rom_sgpio_get_input_rxdata(hal_sgpio_adapter_t *psgpio_adp)
{
	u32 rxdata_tp;

	rxdata_tp = hal_rom_sgpio_get_rxdata(psgpio_adp);
	rxdata_tp = hal_rom_sgpio_get_arrange_rxdata(psgpio_adp, rxdata_tp);

	return rxdata_tp;
}

/**
 *  @brief Get the mask and arrange rxdata.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  rxdata_tp The rxdata value.
 *
 *  @returns The rxdata result.
 */
SECTION_SGPIO_TEXT
u32 hal_rom_sgpio_get_arrange_rxdata(hal_sgpio_adapter_t *psgpio_adp, u32 rxdata_tp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u8 bit_length;
	u32 bit_length_mask;
	u8 bit_length_shift;

