Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	bit_length = ((psgpio_reg->SGPIO_RXPOSR & SGPIO_MASK_RXPOSRST) >> SGPIO_SHIFT_RXPOSRST) + 1;

	bit_length_mask = 0xFFFFFFFF;
	bit_length_shift = 32 - bit_length;
	bit_length_mask = bit_length_mask >> bit_length_shift;

	if (psgpio_adp->sgpio_rx_info.first_data_flag == First_Data_LSB) {
		rxdata_tp = rxdata_tp >> bit_length_shift;
	}

	rxdata_tp = rxdata_tp & bit_length_mask;

	return rxdata_tp;
}

/**
 *  @brief Set the trigger edge to start the timer, and translate the capture time into "0" or "1" according to the result of the comparison.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_compare_data The parameter structure is for initializing the capture compare rxdata.
 *                      sampling_en - To enable or disable.
 *                      capture_en - Select the trigger edge for starting the rxtc timer.
 *                      input_capture_edge - Select the capture edge for capturing the time.
 *                      max_capture_range_us - Set the maximum possible measurement value for making the prescale of the timer automatically.
 *                      time_unit - Select the time unit.
 *                      capture_compare_value_time - Set the compare time.
 *                      compare_result_bit - Deciding the value of the result bit is "0" or "1".
 *                      compare_bit_length - Set the bit length generated the interrupt. Value: 1 ~ 32, 0: do nothing.
 *                      first_msb_or_lsb - Putting in the register is LSB or MSB.
 *                      sampling_finish_cb - User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      psampling_finish_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_capture_compare_rxdata(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_capture_compare_rxdata_t *psgpio_compare_data)
{
	hal_sgpio_rxtc_capture_mode_t rxtc_capture_mode;
	hal_sgpio_set_irq_t sgpio_set_irq;

	rxtc_capture_mode.capture_en = psgpio_compare_data->capture_en;
	rxtc_capture_mode.start_timer_edge = psgpio_compare_data->start_timer_edge;
	rxtc_capture_mode.input_capture_edge = psgpio_compare_data->input_capture_edge;
	rxtc_capture_mode.capture_timer_reset_en = 1;
	rxtc_capture_mode.capture_timer_disable_en = 1;
	rxtc_capture_mode.max_capture_range_us = psgpio_compare_data->max_capture_range_us;
	rxtc_capture_mode.capture_cb = NULL;
	rxtc_capture_mode.pcapture_arg = NULL;
	hal_rom_sgpio_rxtc_capture_mode(psgpio_adp, &rxtc_capture_mode);

	hal_rom_sgpio_set_rxdata_direction(psgpio_adp, psgpio_compare_data->first_msb_or_lsb);
	psgpio_adp->sgpio_rx_info.first_data_flag = psgpio_compare_data->first_msb_or_lsb;

	if (psgpio_compare_data->capture_en != 0x00) {
		hal_rom_sgpio_init_rxdata_capture_compare_time(psgpio_adp, psgpio_compare_data->compare_result_bit, psgpio_compare_data->time_unit,
				psgpio_compare_data->capture_compare_value_time);
	} else {
		hal_rom_sgpio_deinit_rxdata_capture_compare(psgpio_adp);
	}

	sgpio_set_irq.imr_en = 0;
	if (psgpio_compare_data->compare_finish_cb != NULL) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_compare_data->compare_finish_cb;
		sgpio_set_irq.arg = psgpio_compare_data->pcompare_finish_arg;
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
	}
	hal_rom_sgpio_set_rxdata_load_int(psgpio_adp, psgpio_compare_data->compare_bit_length, &sgpio_set_irq);

}

/**
 *  @brief Configure the waveforms of the bit 0 and bit 1 for the output.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_txdata_bit_symbol The parameter structure is for initializing the txdata bit symbol.
 *                      initial_output_value - Set the initial output value.
 *                      time_unit - Select the time unit.
 *                      bit0_middle_change_time - The time is to change the output value for the bit 0.
 *                      bit0_duration_time - The duration of the bit 0.
 *                      bit1_middle_change_time - The time is to change the output value for the bit 1.
 *                      bit1_duration_time - The duration of the bit 1.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_txdata_bit_symbol(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_txdata_bit_symbol_t *psgpio_txdata_bit_symbol)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u16 cnt_tp;
	sgpio_time_unit_t time_unit;
	u32 reg_temp;

	time_unit = psgpio_txdata_bit_symbol->time_unit;

	if (psgpio_txdata_bit_symbol->initial_output_value == Output_Is_Low) {
		reg_temp = psgpio_reg->SGPIO_OUTPUT;
		reg_temp &= ~(SGPIO_BIT_OUTPUT);
		psgpio_reg->SGPIO_OUTPUT = reg_temp;
	} else {
		reg_temp = psgpio_reg->SGPIO_OUTPUT;
		reg_temp |= SGPIO_BIT_OUTPUT;
		psgpio_reg->SGPIO_OUTPUT = reg_temp;
	}

	hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent1, 0x00);
	hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup1, Multc_MatchEvent1, 0x00);

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, psgpio_txdata_bit_symbol->bit0_middle_change_time);
	hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent2, cnt_tp);

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, psgpio_txdata_bit_symbol->bit0_duration_time);
	hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup0, Multc_MatchEvent0, cnt_tp);

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, psgpio_txdata_bit_symbol->bit1_middle_change_time);
	hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup1, Multc_MatchEvent2, cnt_tp);

	cnt_tp = (u16)hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, psgpio_txdata_bit_symbol->bit1_duration_time);
	hal_rom_sgpio_set_multc_match_value(psgpio_adp, Multc_MatchGroup1, Multc_MatchEvent0, cnt_tp);

	hal_rom_sgpio_set_multc_external_match(psgpio_adp, Multc_MatchEvent1, External_Toggle);
	hal_rom_sgpio_set_multc_external_match(psgpio_adp, Multc_MatchEvent2, External_Toggle);


