Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
}

/**
 *  @brief Set the output data according to the waveforms of the bit 0 and bit 1.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  psgpio_txdata The parameter structure is for initializing the txdata.
 *                      txdata_en - To enable or disable.
 *                      rx_output_en - Control the output behavior of the bidirectional Rx.
 *                      output_bit_counts - Set the output bit number.
 *                      ptxdata_pointer - Set the output data pointer.
 *                      txdata_finish_cb - When finish the TX output, generate the interrupt.
 *                      ptxdata_finish_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_txdata(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_txdata_t *psgpio_txdata)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	hal_sgpio_set_irq_t sgpio_set_irq;
	u32 bit_counts_tp, bit_counts_quot, bit_counts_rem;
	u16 bit_length;
	u32 *ptxdata_pointer;
	u32 reg_temp;

	if (psgpio_txdata->txdata_en != 0x00) {

		reg_temp = psgpio_reg->SGPIO_MULMC;
		reg_temp |= SGPIO_BIT_MUL_MCNTSTOP_EN;
		reg_temp |= SGPIO_BIT_MUL_MR0RST_EN;
		reg_temp |= SGPIO_BIT_MUL_MCNTRST_EN;
		reg_temp |= SGPIO_BIT_MUL_MR0SCLK_EN;
		psgpio_reg->SGPIO_MULMC = reg_temp;

		reg_temp = psgpio_reg->SGPIO_MULEMR;
		reg_temp &= ~(SGPIO_BIT_BIOUT_EN);
		reg_temp |= (psgpio_txdata->rx_direction_output_en << SGPIO_SHIFT_BIOUT_EN);
		psgpio_reg->SGPIO_MULEMR = reg_temp;

		bit_length = psgpio_txdata->output_bit_counts;
		if (bit_length > 32) {
			bit_length = 32;
		}
		psgpio_adp->sgpio_tx_info.bit_length_copy = bit_length;
		sgpio_set_irq.imr_en = 0;
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = hal_rom_sgpio_txdata_bit_length_irq;
		sgpio_set_irq.arg = psgpio_adp;
		hal_rom_sgpio_set_txdata_bit_length_int(psgpio_adp, bit_length, &sgpio_set_irq);

		psgpio_adp->sgpio_tx_info.output_bit_counts_copy = psgpio_txdata->output_bit_counts;
		bit_counts_tp = psgpio_txdata->output_bit_counts;

		bit_counts_quot = 0;
		if (bit_counts_tp > 64) {
			bit_counts_quot = bit_counts_tp >> 5;
			bit_counts_rem = bit_counts_tp & 0x1F;
			if (bit_counts_rem != 0x00) {
				bit_counts_quot = bit_counts_quot + 1;
			}
			bit_counts_quot = bit_counts_quot - 2;
		}
		psgpio_adp->sgpio_tx_info.bit_counts_quot_irq = bit_counts_quot;
		psgpio_adp->sgpio_tx_info.bit_counts_quot_irq_source = psgpio_adp->sgpio_tx_info.bit_counts_quot_irq;

		psgpio_adp->sgpio_tx_info.ptxdata_pointer_copy = psgpio_txdata->ptxdata_pointer;
		ptxdata_pointer = psgpio_txdata->ptxdata_pointer;
		psgpio_adp->sgpio_tx_info.ptxdata_pointer_irq = ptxdata_pointer;

		psgpio_reg->SGPIO_MULDATA = *ptxdata_pointer;

		if (bit_counts_tp > 32) {
			psgpio_adp->sgpio_tx_info.ptxdata_pointer_irq = (ptxdata_pointer + 1);
			psgpio_reg->SGPIO_MULDATA_DP = *(ptxdata_pointer + 1);
		}

		sgpio_set_irq.imr_en = 0;
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = psgpio_txdata->txdata_finish_cb;
		sgpio_set_irq.arg = psgpio_txdata->ptxdata_finish_arg;
		hal_rom_sgpio_set_multc_match_event0_cnt_int(psgpio_adp, 1, psgpio_txdata->output_bit_counts, &sgpio_set_irq);


	} else {
		sgpio_set_irq.imr_en = 0;
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
		hal_rom_sgpio_set_txdata_bit_length_int(psgpio_adp, 0, &sgpio_set_irq);
		hal_rom_sgpio_set_multc_match_event0_cnt_int(psgpio_adp, 0, 0, &sgpio_set_irq);

		psgpio_adp->sgpio_tx_info.bit_counts_quot_irq = 0;
		psgpio_adp->sgpio_tx_info.bit_counts_quot_irq_source = 0;
		psgpio_adp->sgpio_tx_info.ptxdata_pointer_irq = NULL;
	}
}

/**
 *  @brief Process txdata in the interrupt handler
 *
 *  @param[in]  data Set the SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_txdata_bit_length_irq(void *data)
{
	hal_sgpio_adapter_t *psgpio_adp = (hal_sgpio_adapter_t *) data;
	SGPIO_TypeDef *psgpio_reg;

	psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;

	if (psgpio_adp->sgpio_tx_info.bit_counts_quot_irq != 0x00) {
		psgpio_reg->SGPIO_MULDATA_DP = *(psgpio_adp->sgpio_tx_info.ptxdata_pointer_irq  + 1);
		psgpio_adp->sgpio_tx_info.ptxdata_pointer_irq = (psgpio_adp->sgpio_tx_info.ptxdata_pointer_irq  + 1);
		psgpio_adp->sgpio_tx_info.bit_counts_quot_irq = psgpio_adp->sgpio_tx_info.bit_counts_quot_irq - 1;
	}

}

/**
 *  @brief Start to output the TX data.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_send_txdata(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 *ptxdata_pointer;
	u32 bit_counts_tp;
	u32 reg_temp;

	ptxdata_pointer = psgpio_adp->sgpio_tx_info.ptxdata_pointer_copy;

	if (ptxdata_pointer != NULL) {
		hal_rom_sgpio_set_multc_rst(psgpio_adp);
		if (psgpio_adp->sgpio_tx_info.bit_length_copy != 0x00) {
			reg_temp = psgpio_reg->SGPIO_MULPOSR;
			reg_temp &= ~(SGPIO_MASK_MULPOSTC);
			reg_temp |= ((psgpio_adp->sgpio_tx_info.bit_length_copy - 1) << SGPIO_SHIFT_MULPOSTC);
			psgpio_reg->SGPIO_MULPOSR = reg_temp;
		} else {
			reg_temp = psgpio_reg->SGPIO_MULPOSR;
			reg_temp &= ~(SGPIO_MASK_MULPOSTC);
			psgpio_reg->SGPIO_MULPOSR = reg_temp;
		}
		if (psgpio_adp->sgpio_tx_info.output_bit_counts_copy != 0x00) {
			reg_temp = psgpio_reg->SGPIO_MUL_MCNT;
			reg_temp &= ~(SGPIO_MASK_MUL_MCNT);
			reg_temp |= ((psgpio_adp->sgpio_tx_info.output_bit_counts_copy - 1) << SGPIO_SHIFT_MUL_MCNT);
			psgpio_reg->SGPIO_MUL_MCNT = reg_temp;
		} else {
			reg_temp = psgpio_reg->SGPIO_MUL_MCNT;
			reg_temp &= ~(SGPIO_MASK_MUL_MCNT);
			psgpio_reg->SGPIO_MUL_MCNT = reg_temp;
		}

		bit_counts_tp = psgpio_adp->sgpio_tx_info.output_bit_counts_copy;

		psgpio_reg->SGPIO_MULDATA = *ptxdata_pointer;

		if (bit_counts_tp > 32) {
			ptxdata_pointer = ptxdata_pointer + 1;
			psgpio_reg->SGPIO_MULDATA_DP = *ptxdata_pointer;
		}

		psgpio_adp->sgpio_tx_info.bit_counts_quot_irq = psgpio_adp->sgpio_tx_info.bit_counts_quot_irq_source;
		psgpio_adp->sgpio_tx_info.ptxdata_pointer_irq = ptxdata_pointer;
		hal_rom_sgpio_set_multc_start_en(psgpio_adp, 1);
	} else {
		//dbg_printf("hal_sgpio_send_txdata_rtl8195bhp: ptxdata_pointer is null \r\n");
	}
}

/**
 *  @brief Reset the register of the RX data.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_reset_receive_rxdata(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

