Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	if (psgpio_adp->sgpio_rx_info.rx_bit_length_copy != 0x00) {
		reg_temp = psgpio_reg->SGPIO_RXPOSR;
		reg_temp &= ~(SGPIO_MASK_RXPOSRST);
		reg_temp |= ((psgpio_adp->sgpio_rx_info.rx_bit_length_copy - 1) << SGPIO_SHIFT_RXPOSRST);
		psgpio_reg->SGPIO_RXPOSR = reg_temp;

		reg_temp = psgpio_reg->SGPIO_RXPOSR;
		reg_temp &= ~(SGPIO_MASK_RXPOSTC);
		reg_temp |= ((psgpio_adp->sgpio_rx_info.rx_bit_length_copy - 1) << SGPIO_SHIFT_RXPOSTC);
		psgpio_reg->SGPIO_RXPOSR = reg_temp;

	} else {
		reg_temp = psgpio_reg->SGPIO_RXPOSR;
		reg_temp &= ~(SGPIO_MASK_RXPOSRST);
		psgpio_reg->SGPIO_RXPOSR = reg_temp;
	}
	hal_rom_sgpio_reset_rxdata(psgpio_adp);
}

/**
 *  @brief Disable the monitor mode.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_disable_rxdata_match(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_DATA_CTRL;
	reg_temp &= ~(SGPIO_BIT_PATTERN_MATCH_MODE);
	psgpio_reg->SGPIO_DATA_CTRL = reg_temp;
}

/**
 *  @brief Monitor the register of the sample or capture data. When the register value is equal to the monitor data, generate the interrupt.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  pmonitor_rxdata The parameter structure is for initializing the monitor rxdata.
 *                      monitor_en - To enable or disable.
 *                      monitor_data - Set the monitor data.
 *                      monitor_input_data_mask - Set the bit mask of the monitor data.
 *                      monitor_rxdata_cb -User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      pmonitor_rxdata_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_monitor_rxdata(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_monitor_rxdata_t *pmonitor_rxdata)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	hal_sgpio_set_irq_t sgpio_set_irq;
	u8 bit_length;
	u32 bit_length_mask;
	u8 bit_length_shift;
	u32 monitor_data;
	u32 mask_value;

	bit_length = ((psgpio_reg->SGPIO_RXPOSR & SGPIO_MASK_RXPOSRST) >> SGPIO_SHIFT_RXPOSRST) + 1;

	bit_length_mask = 0xFFFFFFFF;
	bit_length_shift = 32 - bit_length;
	bit_length_mask = bit_length_mask >> bit_length_shift;
	monitor_data = pmonitor_rxdata->monitor_data & bit_length_mask;
	mask_value = pmonitor_rxdata->monitor_input_data_mask & bit_length_mask;

	if (psgpio_adp->sgpio_rx_info.first_data_flag == First_Data_LSB) {
		monitor_data = monitor_data << bit_length_shift;
		mask_value = mask_value << bit_length_shift;
	}

	sgpio_set_irq.imr_en = 0;
	if ((pmonitor_rxdata->monitor_en != 0x00) && (pmonitor_rxdata->monitor_rxdata_cb != NULL)) {
		sgpio_set_irq.int_en = 1;
		sgpio_set_irq.callback_reg_en = 1;
		sgpio_set_irq.callback = pmonitor_rxdata->monitor_rxdata_cb;
		sgpio_set_irq.arg = pmonitor_rxdata->pmonitor_rxdata_arg;
		hal_rom_sgpio_set_rxdata_match_int(psgpio_adp, 1, monitor_data, &sgpio_set_irq);
	} else {
		sgpio_set_irq.int_en = 0;
		sgpio_set_irq.callback_reg_en = 0;
		hal_rom_sgpio_set_rxdata_match_int(psgpio_adp, 0, monitor_data, &sgpio_set_irq);
		hal_rom_sgpio_reset_rxdata(psgpio_adp);
	}

	psgpio_reg->SGPIO_RXDATAMASK = mask_value;

}

/**
 *  @brief Reset the multc FIFO.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_multc_fifo_reset(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u8 mul_fmode_en_tp;
	u32 reg_temp;

	mul_fmode_en_tp = (psgpio_reg->SGPIO_MULMC & SGPIO_BIT_MUL_FMODE_EN) >> SGPIO_SHIFT_MUL_FMODE_EN;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp &= ~(SGPIO_BIT_MUL_FMODE_EN);
	psgpio_reg->SGPIO_MULMC = reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp &= ~(SGPIO_BIT_MUL_FMODE_EN);
	reg_temp |= (mul_fmode_en_tp << SGPIO_SHIFT_MUL_FMODE_EN);
	psgpio_reg->SGPIO_MULMC = reg_temp;

}

/**
 *  @brief Set the interrupt handler for the dma match output
 *
 *  @param[in]  data Set the SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_dma_match_output_irq_handle(void *data)
{
	hal_sgpio_adapter_t *psgpio_adp = (hal_sgpio_adapter_t *) data;

	// Call user TX complete callback
	if (NULL != psgpio_adp->sgpio_dma_info.irq_user_dma_cb) {
		psgpio_adp->sgpio_dma_info.irq_user_dma_cb(psgpio_adp->sgpio_dma_info.user_dma_arg);
	}

	//dbg_printf("=== Enter hal_sgpio_dma_match_output_irq_handle_rtl8195bhp === \r\n");
}

/**
 *  @brief Init GDMA for the dma match output
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  pgdma_adaptor The GDMA adapter.
 *  @param[in]  pdma_match_output The parameter structure is for initializing the SGPIO dma output.
 *                      match_value1_output - Set the output value when match value 1.
 *                      match_value2_output - Set the output value when match value 2.
 *                      match_value3_output - Set the output value when match value 3.
 *                      pmatch_value_ptr -The pointer is the memory address of setting the match time.
 *                      match_reset_counter - Set the number of reset times. An interrupt will be generated when the number of times is reached.
 *                      counter_finish_cb -User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      pcounter_finish_arg - User defined IRQ callback parameter.
 *
 *  @returns Always return HAL_OK
 */
SECTION_SGPIO_TEXT
HAL_Status hal_rom_sgpio_dma_match_output_init(hal_sgpio_adapter_t *psgpio_adp, hal_gdma_adaptor_t *pgdma_adaptor,
		hal_sgpio_dma_match_output_t *pdma_match_output)
{
	u8 sgpio_gdma_tp;

	psgpio_adp->phal_gdma_adaptor = pgdma_adaptor;


	if (psgpio_adp->sgpio_index == Sgpio0_Sel) {
		sgpio_gdma_tp = GDMA_HANDSHAKE_SGPIO0_TX;
	} else if (psgpio_adp->sgpio_index == Sgpio1_Sel) {
		sgpio_gdma_tp = 0; // Unknow
	} else if (psgpio_adp->sgpio_index == Sgpio2_Sel) {
		sgpio_gdma_tp = 0; // Unknow
	} else {
		return HAL_ERR_PARA;
	}

	pgdma_adaptor->gdma_ctl.tt_fc = TTFCMemToPeri;
	pgdma_adaptor->gdma_cfg.reload_dst = 1;
	pgdma_adaptor->gdma_cfg.dest_per = sgpio_gdma_tp;
	pgdma_adaptor->ch_dar = ((u32)psgpio_adp->base_addr + REG_PERI_MULFDATA);
	pgdma_adaptor->gdma_isr_type = (TransferType | ErrType);
	pgdma_adaptor->gdma_ctl.int_en = 1;
	pgdma_adaptor->gdma_ctl.dinc = NoChange;
	pgdma_adaptor->gdma_ctl.sinc = IncType;
	// cofigure gdma transfer
	pgdma_adaptor->gdma_ctl.src_msize   = MsizeFour;
	pgdma_adaptor->gdma_ctl.src_tr_width = TrWidthTwoBytes;
	pgdma_adaptor->gdma_ctl.dest_msize  = MsizeFour;
	pgdma_adaptor->gdma_ctl.dst_tr_width = TrWidthTwoBytes;
	pgdma_adaptor->gdma_ctl.block_size = 4 * pdma_match_output->match_reset_counter; //---4*length
	pgdma_adaptor->ch_sar = (u32)pdma_match_output->pmatch_value_ptr;

	hal_gdma_irq_reg(pgdma_adaptor, hal_rom_sgpio_dma_match_output_irq_handle, psgpio_adp);

	psgpio_adp->sgpio_dma_info.irq_user_dma_cb = pdma_match_output->counter_finish_cb;
	psgpio_adp->sgpio_dma_info.user_dma_arg = pdma_match_output->pcounter_finish_arg;

