Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/source/ram/rtl8735b_sgpio.c
	hal_rom_sgpio_dma_handshake_init(psgpio_adp, pdma_match_output);

	return HAL_OK;
}

/**
 *  @brief De-initialize GDMA for the dma match output
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns Always return HAL_OK
 */
SECTION_SGPIO_TEXT
HAL_Status hal_rom_sgpio_dma_match_output_deinit(hal_sgpio_adapter_t *psgpio_adp)
{
	if (psgpio_adp->phal_gdma_adaptor != NULL) {

		psgpio_adp->phal_gdma_adaptor = NULL;
	}

	return HAL_OK;
}

/**
 *  @brief Init the handshake for SGPIO and GDMA.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  pdma_match_output The parameter structure is for initializing the SGPIO dma output.
 *                      match_value1_output - Set the output value when match value 1.
 *                      match_value2_output - Set the output value when match value 2.
 *                      match_value3_output - Set the output value when match value 3.
 *                      pmatch_value_ptr -The pointer is the memory address of setting the match time.
 *                      match_reset_counter - Set the number of reset times. An interrupt will be generated when the number of times is reached.
 *                      counter_finish_cb -User defined IRQ callback function. Using "NULL" will not generate this interrupt.
 *                      pcounter_finish_arg - User defined IRQ callback parameter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_dma_handshake_init(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_dma_match_output_t *pdma_match_output)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp |= SGPIO_BIT_MUL_FMODE_EN;
	reg_temp |= SGPIO_BIT_MUL_MR0RST_EN;
	reg_temp |= SGPIO_BIT_MUL_MCNTRST_EN;
	reg_temp |= SGPIO_BIT_MUL_MCNTSTOP_EN;
	reg_temp |= SGPIO_BIT_MUL_MR0MCNT_EN;
	reg_temp |= SGPIO_BIT_MUL_DMA_EN;
	psgpio_reg->SGPIO_MULMC = reg_temp;

	hal_rom_sgpio_set_multc_external_match(psgpio_adp, Multc_MatchEvent1, pdma_match_output->match_value1_output);
	hal_rom_sgpio_set_multc_external_match(psgpio_adp, Multc_MatchEvent2, pdma_match_output->match_value2_output);
	hal_rom_sgpio_set_multc_external_match(psgpio_adp, Multc_MatchEvent3, pdma_match_output->match_value3_output);

	if (pdma_match_output->match_reset_counter != 0x00) {
		reg_temp = psgpio_reg->SGPIO_MUL_MCNT;
		reg_temp &= ~(SGPIO_MASK_MUL_MCNT);
		reg_temp |= ((pdma_match_output->match_reset_counter - 1) << SGPIO_SHIFT_MUL_MCNT);
		psgpio_reg->SGPIO_MUL_MCNT = reg_temp;
	} else {
		reg_temp = psgpio_reg->SGPIO_MUL_MCNT;
		reg_temp &= ~(SGPIO_MASK_MUL_MCNT);
		psgpio_reg->SGPIO_MUL_MCNT = reg_temp;
	}

	reg_temp = (psgpio_reg->SGPIO_MUL_MCNT & SGPIO_MASK_MUL_MCNT) >> SGPIO_SHIFT_MUL_MCNT;
	psgpio_adp->sgpio_dma_info.match_reset_counter_copy = reg_temp;

}

/**
 *  @brief Preload the data to the buffer for starting GDMA.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_dma_preload_data(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 reg_temp;

	reg_temp = psgpio_reg->SGPIO_MULMC;
	reg_temp &= ~(SGPIO_BIT_MUL_DMA_START);
	reg_temp |= (1 << SGPIO_SHIFT_MUL_DMA_START);
	psgpio_reg->SGPIO_MULMC = reg_temp;

	while (((psgpio_reg->SGPIO_MULMC & SGPIO_BIT_MUL_DMA_START) >> SGPIO_SHIFT_MUL_DMA_START) == 1);
}

/**
 *  @brief Start the GDMA to send the TX waveform.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_dma_send_start(hal_sgpio_adapter_t *psgpio_adp)
{
	SGPIO_TypeDef *psgpio_reg = (SGPIO_TypeDef *)psgpio_adp->base_addr;
	u32 clean_cnt;
	phal_gdma_adaptor_t phal_gdma_adaptor;
	u32 reg_temp;

	clean_cnt = (u32)((u32)(psgpio_adp->sgpio_dma_info.match_reset_counter_copy + 1) << 3);

	if (psgpio_adp->dcache_memory_en == 1) {
		if (psgpio_adp->dcache_clean_by_addr != NULL) {
			psgpio_adp->dcache_clean_by_addr((uint32_t *)psgpio_adp->pmemory_addr, (int32_t)clean_cnt);
		} else {
			dbg_printf(" psgpio_adp->dcache_clean_by_addr is null \r\n");
		}
	}

	phal_gdma_adaptor = psgpio_adp->phal_gdma_adaptor;

	hal_rom_sgpio_multc_fifo_reset(psgpio_adp);
	hal_gdma_transfer_start(phal_gdma_adaptor, MultiBlkDis);
	hal_rom_sgpio_dma_preload_data(psgpio_adp);

	reg_temp = psgpio_reg->SGPIO_MUL_MCNT;
	reg_temp &= ~(SGPIO_MASK_MUL_MCNT);
	reg_temp |= (psgpio_adp->sgpio_dma_info.match_reset_counter_copy << SGPIO_SHIFT_MUL_MCNT);
	psgpio_reg->SGPIO_MUL_MCNT = reg_temp;

	hal_rom_sgpio_set_multc_start_en(psgpio_adp, 1);
}

/**
 *  @brief Change the memory data from the time unit to the count unit.
 *
 *  @param[in]  psgpio_adp The SGPIO adapter.
 *  @param[in]  pmemory_addr The pointer is the memory address of setting the match time.
 *  @param[in]  reset_cnt Set the number of reset times. An interrupt will be generated when the number of times is reached.
 *  @param[in]  time_unit Select the time unit.
 *
 *  @returns void
 */
SECTION_SGPIO_TEXT
void hal_rom_sgpio_dma_time_to_multc(hal_sgpio_adapter_t *psgpio_adp, u16 *pmemory_addr, u8 reset_cnt, sgpio_time_unit_t time_unit)
{
	u32 i, reset_cnt_tp;
	u16 value_max, value_tp;

	reset_cnt_tp = (u32)((u32)reset_cnt << 2);

	psgpio_adp->pmemory_addr = pmemory_addr;
	value_max = *pmemory_addr;

	for (i = 0; i < reset_cnt_tp; i++) {

		value_tp = *(pmemory_addr + i);
		if (value_max < value_tp) {
			value_max = value_tp;
		}
	}

	hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, value_max);

	for (i = 0; i < reset_cnt_tp; i++) {

		value_tp = *(pmemory_addr + i);
		*(pmemory_addr + i) = hal_rom_sgpio_set_time_to_multc(psgpio_adp, time_unit, value_tp);
	}

}

/** @} */ /* End of group hs_hal_sgpio_rom_func */
/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

/** @} */ /* End of group hs_hal_sgpio */

#endif /* CONFIG_SGPIO_EN */
